{
    "op": {
        "upvote_ratio": null,
        "selftext": "BadBIOS hijacks file permissions\n\n\"The /var/log/wtmp and /var/run/utmp files contain the login records for all users on your system. Their integrity \n\nmust be maintained because they can be used to determine when and from where a user (or potential intruder) has \n\nentered your system. These files should also have 644 permissions, without affecting normal system operation.\" \nhttp://tldp.org/HOWTO/Security-HOWTO/file-security.html\n\nThis morning, I booted offline to PCLinuxOS FullMonty, purchased from OSDisc.com. I cannot read the /var/log/wtmp \n\nand /var/run/utmp files because BadBIOS altered them to an unknown file type and because I am denied file \n\npermissions to read them.\n\n/var/log/wtmp.log file permissions:\n\nFile type: unknown\nOwner: read and write\nGroup read and write\nOthers: read\nUser: root\nGroup: utmp\n\n/var/run/utmp file permissions:\n\nFile type: unknown\nOwner: read and write\nGroup: read and write\nOthers: read\nUser: root\nGroup: utmp\n\nLog files should be plain text files. Plain text editors should be able to read them. Other logs of unknown file \n\ntype are var/log/explanations.log and /var/log/explanations.log\n\nvar/log/lastlog file permissions:\nFile type: unknown\nOwner: forbidden\nGroup: forbidden\nOthers: forbidden\nUser and Group: root\n\n/var/log/explanations.log file permissions:\nFile type: unknown\nOwner: read and write\nGroup and others: forbidden\nUser: root\nGroup: root\n\nLogs of unknown file type and being denied file permissions to read logs have occured starting in 2011 when I \n\nbooted offline to a dozen linux live DVDs, some of which were purchased from OSDisc.com. Likewise, offline booting \n\noff my pengpod tablet with Ubuntu preinstalled, offline booting of raspberry pi with Pibang (Debian remix) and \n\nPidora (Fedora remix) and offline booting of PCArduino with Ubuntu preinstalled.\n\nI am denied file permissions to read msec's log. See \n\nhttp://www.reddit.com/r/Malware/comments/24jyg5/badbios_font_evidence/\n\nOther security logs I am denied permission to read in live PCLinuxOS DVD are:\n\n/var/log/security.log file permissions:\nOwner: read and write\nGroup: read\nOthers: forbidden\nUser and Group: root\n\n/var/log/rkhunter-cronjob.log file permissions:\nowner: read and write\nGroup: forbidden\nOthers: forbidden\nUser and group: root\n\n/var/log/squid/squid.out reports that it can't find cache. However, squid.cache.log is 23.2 kb, which is large. I \n\nam denied file permission to read it.\n\n/var/log/squid/squid.cache.log \nOwner: read and write\nGroup: read\nOthers: forbidden\nUser: Squid\nGroup: squid\n\nAfter booting offline to a linux DVD, I can log in as root in the terminal but with most linux distros, I cannot log in as root using the graphical desktop.\n\nAfter logging in as root using the graphical desktop, I am often remotely logged out of session. I cannot log back in as root. The only option is to log in as guest.  After logging in as guest, I am sometimes remotely logged out of session.\n\nWhen logged into the terminal or graphical desktop as root, I do not actually have root privileges. It is fakeroot.  \"Fakeroot provides a fake root environment by means of LD_PRELOAD and SYSV IPC (or TCP) trickery.\"\nhttp://fakeroot.alioth.debian.org/\n\nOffline, removable media will not mount\nOffline, removable media mounts read only. Even after logging in as root, the file permissions of the removable media cannot be changed.\n\nOffline, removable media mounts read and write and is later altered to read only. I do not have the file permission to change it back to read and write.\n\nOffline, removable media mounts and is later unmounted. Removable media cannot be remounted without logging out and logging into a new session or shutting down the computer and rebooting.\n\nI cannot make a back up copy of files on a harddrive or removable media to another removable media. The second removable media is mounted read only. I cannot change the file permission of the second removable media.\n\nIf I log in as root and removable media mounts read and write, after creating or editing a file, the file permissions are altered to read only. As root, I cannot change the file permissions back. The newly created file or edited file cannot be saved.",
        "title": "BadBIOS hijacks file permissions",
        "score": 0,
        "id": "24k1kb",
        "commsNum": 4,
        "timeStamp": "2014/05/02-10:26:08",
        "author_name": "BadBiosvictim",
        "is_self": true,
        "locked": null,
        "num_comments": 4,
        "over_18": false,
        "spoiler": null,
        "subreddit": "malware",
        "stickied": false,
        "url": "http://www.reddit.com/r/Malware/comments/24k1kb/badbios_hijacks_file_permissions/"
    },
    "posts": {}
}