{
    "op": {
        "upvote_ratio": null,
        "selftext": "Ok... so I got this really weird email that slipped past all the usual Bayesian filter goodness.  Curious aspects are that no identifying information was provide in message body, great lengths were taken to obscure the origin and, of course, the ever present \"too good to be true\" bait offer.  The part that really caught my eye was \"relocation provided\", but no work visa (technically a violation of &lt;Country I'm In&gt;'s laws).   \n\nMy email address was apparently obtained from a very old job advertising site that is highly specialize for a particular area, &lt;Country I'm In&gt;.\n\n\nX-Get-Message-Sender-Via: eugene.servershost.net: authenticated_id: manar@mticsy.com\n\nReply-To: line@staff-insight.com\n\nI tried looking around for any information about staff-insight.com, but came up empty.  I assume that it's just another level of obfuscation.  Has anyone seen it used in any other phishing attacks? \n \nThe copy reads:\n\nAssistant Manager employment offer in &lt;Country I'm In&gt;.\n \nDear &lt;Me, First Name, Familiar&gt;,\n\nAfter screening through a great number of managerial resumes kindly submitted by our partner HR agencies in &lt;Country I'm In&gt;, we determined that you should be included in the shortlist of candidates for the position of Assistant Manager open at our company.\n\nWe have reviewed your CV in detail, and now, after having discussed your candidacy with the company management, are pleased to inform you that the company is highly interested in hiring you to fill this position. Let me describe in short the company's profile and the position you are encouraged to apply for.\n\nWHY THE COMPANY WANTS YOU?\n\nWith a massive expansion campaign going on, the company has initiated a smart recruitment drive with the aim of hiring an adequate number of new staff members.\n\nWe are in search for confident, responsible, and dedicated people who \nwish to commence a career in a dynamic international investment company. The company is located in the EU, with several affiliate offices across Europe, and can boast a wealth of valuable industry experience.\n\nThe position currently open at the company offers outstanding career prospects in fields such as finance and customer service and does not require previous finance-related working experience or specific financial education, however, if you have any, it would be easier for you to fit in.\n\nBRIEF POSITION DESCRIPTION\n\nYour employment will start off with a entry level training paid in full by the company, which will gradually turn into an stimulating and challenging job that involves dealing with both in-office and off-site tasks.\n\nThe company offers every new employee a friendly business atmosphere and guarantees overtime pay, paid vacation, bonus schemes, retirement savings, health and dental insurance, and professional development courses.\n\nThe initial pay rate is &lt;about 15% less than I make now&gt; per month.\n\nThe performance bonus payment, amounting to 10% of your monthly salary, is paid once a month.\n\nPosition type: Assistant Manager\nLocation: &lt;Country I'm In&gt;/ Country-Wide\nOpening date: January 06, 2015\nClosing date: Open until filled\n\nRequirements: Citizenship or Permanent / Temporary residence in &lt;Country I'm In&gt;\nRelocation Assistance: Relocation assistance provided\nVisa Assistance: No Visa / Work permit assistance provided\n\nTraining / Evaluation: 30 days of training / evaluation. Salary is paid during training / evaluation period.\n\nWorking hours: 4 to 8 hours per day. Extra rewards are available for the highly motivated and dedicated individuals.\n\nFull-time hours: from 9:00 AM to 5:00 PM, Monday through Friday. \nPart-time hours: from 9:00 AM to 1:00 PM, Monday through Friday.\n\nCONTACT US BACK\n\nIf you're willing to proceed with this offer for employment, you have to make sure that you can start your training in the upcoming 2-4 weeks.\n\nWe are looking forward to your reply to this letter.\n\nOnce we have received your email, we will provide you with a detailed description of the position including recruiting company information.\n\nWe hope for your positive answer and will be happy to collaborate with you and finally schedule your initial phone interview with the company.\n\nSincerely,\nHuman Resources Dept.\n",
        "title": "Syrian Identity Theft Ring?",
        "score": 1,
        "id": "2t99te",
        "commsNum": 3,
        "timeStamp": "2015/01/21-20:49:42",
        "author_name": "[deleted]",
        "is_self": true,
        "locked": null,
        "num_comments": 3,
        "over_18": false,
        "spoiler": null,
        "subreddit": "malware",
        "stickied": false,
        "url": "http://www.reddit.com/r/Malware/comments/2t99te/syrian_identity_theft_ring/"
    },
    "posts": {}
}