{
    "op": {
        "upvote_ratio": null,
        "selftext": "I really need some help here.  I've been scanning and scanning with malwarebytes and nothing is coming up.  I apparantly have some PUP on my computer.  I had followed some instructions on removing it from my browser and my computer.\n\nUninstalled. \nRemoved extensions.\nScanned and removed everything that it had found.\nStill existed in chrome, most importantly, during my reddit browsing. \nI've scanned twice since then and mwb has not found one thing.  \n\nNoteworthy is that I have yet to virus scan yet, which I'm going to do right after I submit this.  I'm kind of feeling helpless at this moment, as I might have installed something in a hurry and missed a check box.  Like an idiot.  Anyways, help me.\n\n**part of me is starting to feel like some of my search results are actually being provided by outside sources, as well**\n\nOkay, perhaps I wasn't very thorough.  I started off well, but was missing something.  it sucks, but only in a first world kind of way.\n\n1.  Uninstall Positive ads for ... whatever and such It bundles with stupid programs you may download that you shouldn't to cheat at single player video games.\n2. remove extensions from your browsers.  ALL OF THEM.  Sometimes they just won't be in some. \n3. UNINSTALL YOUR BROWSER AND RE-INSTALL IT!!!! &lt;--- I had not done this, and that was the straw that squeaky wheeled the chip off the ole block.\n\nI think step 2 actually is eliminated by step three. So you can skip to step three.  Also, run your malwarebytes, or whatever you use, before you re-install anything as it's just safest.\n\nHope I help someone, IM FREEEEEEEEEEEEEE\n\n*Yes, down-vote a solution, you are the pedestal of society!*",
        "title": "Positive finds ads.",
        "score": 0,
        "id": "2vhprl",
        "commsNum": 6,
        "timeStamp": "2015/02/10-18:33:23",
        "author_name": "[deleted]",
        "is_self": true,
        "locked": null,
        "num_comments": 6,
        "over_18": false,
        "spoiler": null,
        "subreddit": "malware",
        "stickied": false,
        "url": "http://www.reddit.com/r/Malware/comments/2vhprl/positive_finds_ads/"
    },
    "posts": {}
}