{
    "op": {
        "upvote_ratio": null,
        "selftext": "I'm not sure if this is the right place to post this, but this thing has been bugging me for years. It pops up in my mind from time to time and I've finally decided to see if reddit knows anything about it. When I was 4-5 years old (1996-1997) Mc'Donalds franchises in my country (Australia) were providing interactive Mc'Donalds PC games with their happy meals instead of the usual plastic toy. It was put on a CD-ROM. The game was a point and click adventure type game, very innocent and normal. That is until I hit a certain point of the game. Whats funny is that I think it actually had to do something with the burglar guy, and I had just found his massive stash of stolen cheese burgers.\n\nNow I had been playing for like 2 or 3 hours now so I would say it was a pretty \"deep\" part of the game. I remember clicking on something in the mc'burglar's den and the screen immediately going black, and what appeared in big red capitals was \"SELF DESTRUCT IN 10\" with a womans voice counting down from 10. Freaking the fuck out as any 4 or 5 year old would do I screamed for my brother and by the time it went down to 2 I just shut off the PC. I asked my brothers about it, and they weren't and still aren't very tech savy, they only used the PC for IRC and yahoo chatrooms. I remember asking them years later they still had no idea.\n\nNow did any malware like this exist in the mid 1990s? Or was it possibly just one of the developers of the game putting a prank deep in the game because he didn't expect anyone would actually bother playing it for longer than 5 minutes, other than to freak out a few kids like me? I'd really like to know if anyone knows anything about this. If I could find the CD today I would boot it up in sandboxie and test it out again but unfortunately I think I threw it in the garbage. I used that PC quite a lot and I never ever saw that happen again, it only happened when I had been playing the Mc'Donalds game. Keep in mind this was a PC with windows 95. ",
        "title": "Old Mc'Donalds PC Game Virus/Malware or Programmer's Prank?",
        "score": 0,
        "id": "32r0nw",
        "commsNum": 0,
        "timeStamp": "2015/04/15-17:42:45",
        "author_name": "[deleted]",
        "is_self": true,
        "locked": null,
        "num_comments": 0,
        "over_18": false,
        "spoiler": null,
        "subreddit": "malware",
        "stickied": false,
        "url": "http://www.reddit.com/r/Malware/comments/32r0nw/old_mcdonalds_pc_game_virusmalware_or_programmers/"
    },
    "posts": {}
}