{
    "op": {
        "upvote_ratio": null,
        "selftext": "NOTE: This exploit has been resolved already.\n\nFrom /u/korri123\nEDIT: http://pastebin.com/heYvWu5Y \nSome tl;dr about what we know\n\n    hacker manages to inject JavaScript code into imgur. source: https://archive.is/JaJmO \n\n    JS loads a flash swf. decompiled swf shows this AS3 code: http://pastebin.com/ytfKq2Mw \n\n    swf injects saves javascript into localstorage. injected code here: http://pastebin.com/XUssBG5z \n\n    Javascript injects more javascript into the page and evals it. src: http://pastebin.com/myxtBWjh \n\n    Javascript loads something remotely with the url \"'hxxps://8chan.pw/ (Is actually https,  just switched it to hxxp so people don't accidently click it). \n    a_this.uaf\" but uaf is a secret that is calculated somehow. Would have to examine (or just run) the code to figure out what the url is.\n\n    uaf file is being decrypted as of now\n\n    it returned nothing useful\n\n    edit: it actually did return a space when refered to 4chan.org. maybe some other url will return something useful?\n\nthis is what needs to be researched (for any of you javascript and web nerds)\n\n    http://pastebin.com/s0Gw56E0 \n    (focus on gfavsh)\n\n    http://pastebin.com/Fkw7i8CL \n\nlinks:\n\n    https://archive.is/wC1Lo \n    (first thread on /g/)\n\n    https://archive.is/y7rDO \n    (second thread)\n\n    https://archive.is/hBC65 \n    (#3)\n\nGuesses include client-side involuntary DDoS on both/either 8chan and 4chan\n\n\n\n\n\n\n\n\nFrom /u/ItsMeCaptainMurphy:\n\nThis isn't a DDOS. It's targeting 8chan users and leaving javascript code in their local storage that causes their browsers ping back to a command and control server each time they hit an 8chan page. Thus far the C&amp;C server hasn't sent out any commands (or stopped issuing commands before this was discovered). Over the evening whoever authored this has been updating and changing their code. It only effects very specific imgur images/pages. Why is not yet known.\n\nThings to take away:\n\nIf you visit imgur and 8chan you may very well have a big issue. Clear your localstorage (go to 8chan, open your browsers console, type localstorage and see what's there - then type localstorage = [] and hit enter) as well as all browser private information (cookies, passwords, offline storage, etc). See edit #4 for a better way to ensure you're safe. Don't go to 8chan before clearing all local storage.\n\nImgur is compromised. This is the big one and should be very worrisome to anyone on this site. There are three possibilities:\n\n1.) There is an exploit in how imgur processes images that allows someone uploading an image to get code injected into the page when someone else loads the image from imgur\n\n2.) Imgur has one or more servers that are compromised\n\n3.) Imgur has a rogue employee injecting malicious code.\n\nIn all cases, this is really, really bad. It's very unlikely that a 0day exploit on a site as big as imgur is just being used to go after 8chan (unless it's case 3. and someone has a grudge). This allows whoever knows how to take advantage of the exploit to launch an XSS attack against anyone who visits a malicious page on imgur. And there's no way to tell before visiting the page. Not all pages on imgur are compromised and right now it appears to be a very small number of images that had malicious payloads sitting on their page.\n\nHow the attack appears to have worked:\n\n1.) Malicious javascript got onto imgur's server somehow (via one of the three routes outlined above)\n\n2.) This js created iframes and embedded a flash file hosted on 8chan. The iframe was off screen so a user would not notice. Since imgur typically uses flash for parts of its functionality flash asking to run on imgur wouldn't be seen as suspicious.\n\n3.) This flash file injected more javascript into the page (while on the surface looking like an innocuous pikachu animation). This javascript was stored to the user's localstorage (which, since the iframe was pointing at 8chan, allowed the attacker to attach js to 8chan's localstorage). It's functionality is to issue a GET request to 8chan.pw (not an 8chan server AFAIK) and then decrypted the response. So far no one has been able to see a response from that web service, meaning it likely wasn't activated yet or has already been deactivated. The outcome is that every time a user visited an 8chan page, it would \"phone home\" to check for instructions and then execute more javascript code.\n\nI would stress that everyone should disable flash and javascript on imgur for the time being. This attack may not be the only use of this exploit and a lot of very, very bad things could be done through XSS if more people are exploiting this. You should treat the entire site as potentially compromised until imgur addresses this and explains what happened.\n",
        "title": "Imgur Exploited by blackhats",
        "score": 69,
        "id": "3lyroo",
        "commsNum": 13,
        "timeStamp": "2015/09/22-11:17:52",
        "author_name": "EnviousArm",
        "is_self": true,
        "locked": false,
        "num_comments": 13,
        "over_18": false,
        "spoiler": null,
        "subreddit": "malware",
        "stickied": false,
        "url": "https://www.reddit.com/r/Malware/comments/3lyroo/imgur_exploited_by_blackhats/"
    },
    "posts": {}
}