{
    "op": {
        "upvote_ratio": null,
        "selftext": "For starters, I should point out that I'm a beginner with little software engineering skills. While I'm learning, I mostly rely on network forencis and high level process/OS activity for dynamic analysis. I downloaded this sample from malwr.com (link) as something to practice with and found something that I'm not really sure where to start with. \n\n**The make a quick summary of what I'm looking at:**\n\nThe file from the link is a dropped that performs and HTTP get request for gooogledownloadfree[.]net/config/bin.zip. \nThis file is extracted into %appdata%\\Roaming\\NetworkService and drops several executable files, DLLs, and a CA certificate. The CA is moved to the trusted certs folder and seems to be used later for SSL MITM. A \"NetworkService\" service is created and points to one of the dropped exe's. This service opens a port 0.0.0.0:6666 , seemingly to serve as a mitm proxy. \n\nAll traffic goes back to the same IP address the dropped grabbed its binaries from, under a different domain name: youtube4tr[.]com. There is a post to youtube4tr[.]com/api containing a sort of unique ID and some other info I havent figured out yet. \n\n    POST /api HTTP/1.1\n    Content-Type: application/json\n    REQUEST-ACTION: login\n    REQUEST-MODULE: command\n    Content-Length: 66\n    Connection: Keep-Alive\n    Accept-Encoding: gzip, deflate\n    Accept-Language: en-US,*\n    User-Agent: Mozilla/5.0\n    Host: www.youtube4tr.com\n\n    {\"clientID\":\"{e95fff76-f138-494e-b1d6-5e0f230bf188}\", \"ver\":\"2.3\"}HTTP/1.1 200 OK\n    Date: Sat, 31 Oct 2015 18:47:09 GMT\n    Content-Length: 75\n    Content-Type: text/plain; charset=utf-8\n    \n    {\"rc\":0,\"payroll\":null,\"st\":1446317229,\"today\":2015101031,\"time_zone\":3600}\n\n**The interesting part(s):**\n\nIn poking around, I browsed to the c2 server and got a 404 error on the root directory. However, the /config directory is full of folders with date stamps. Each folder contains several .txt file with a name similar to the unique ID spotted in the aforementioned HTTP post. The text files look like they contain keystrokes or something, but nothing else. Most of the language seems either be Portuguese or Italian. Incidentally, I couldn't located any text files with my unique string.\n\nIn futher prodding, I found a list of domains registered by the registrant for original c2 domain (gooogledownloadfree[.]net). The registrant is Oasis Games and some of the other domains returned are: \n\n\n    85.195.110.142 \taccount.uumessenger.com\n    85.195.110.142 \tapi.uumessenger.com\n    85.195.110.142 \tgooogledownloadfree.net\n    85.195.110.142 \tilolbox.com  Link\n    85.195.110.142 \tlolmaster.com \n    85.195.110.142 \twww.lolmaster.com\n    85.195.110.144 \tgogledownload.net\n    85.195.110.144 \tuumessenger.com\n    85.195.110.166 \tlotr.oasgames.com\n    85.195.110.167 \tlotr.oasgames.com\n\nSome are no longer active, others I haven't looked into yet. However, gogledownload[.]net has another file index listing. Of particular interest is http://gogledownload[.]net/download/ which lists an executable 'GoogleMgr.exe'. \n\nI threw that one in the sandbox and this is where I'm totally lost. \nAn HTTP connection is made back to the domain on port 4013. The stream fist send a login of some sort (not sure of encoding), then the client queries ipinfo.io and sends the returned json string (base64 encoded) to the server. \n\nAn HTTP port 8787 is opened on the client, which I cannot connect to the life of me. Any attempt returns a 400 error with \"CallID:\" string appended as the error text. \n\nThe exe spawns a cmd window but it isnt interactive it all, simply displays some info about the connection back to the server. (will screenshot if there's any interest). When an HTTP  request is made, it displays the HTTP packet in the console, but there is no response in the browser. \n\nHas anyone seen anything like this before? Is anyone interested in looking a bit further into this? Any advice for moving forward? \n",
        "title": "[Beginner] What did I find?",
        "score": 32,
        "id": "3r63fc",
        "commsNum": 6,
        "timeStamp": "2015/11/01-19:52:30",
        "author_name": "itsjustfudge",
        "is_self": true,
        "locked": false,
        "num_comments": 6,
        "over_18": false,
        "spoiler": null,
        "subreddit": "malware",
        "stickied": false,
        "url": "https://www.reddit.com/r/Malware/comments/3r63fc/beginner_what_did_i_find/"
    },
    "posts": {}
}