{
    "op": {
        "upvote_ratio": null,
        "selftext": "Hello Reddit's amazing community, this is my first post ever on the internet, so kindly excuse my faults. And I apologize for the long post in advance, but I really need your help, as my whole future depends on your help, and this important post.\n\n\nI am interested in Information Security, in fact, I have a strong passion in it, and that's why I chose IT Security over Medicine, Passion over Money/Prestigious. So I decided to make it my job field.\n\n\nI am enrolled in a Computer science program in a university, 1 month and 12 days left for it to start. I plan to have a master degree in CyberSecurity/IT Security if it's worth it. I have prior experience in hacking some machines, but nothing major, I was just a script kiddie unfortunately.\n\n\nAnd as I want to be a professional hacker/penetration tester, I am building the right strong skillset, including programming, networking, operation systems...before I start hacking any machine, or studying any security related degree/certification. \n\n\nI reached the part of my plan where I learn networking, my plan was like this: Network+ &gt; CCENT &gt; CCNA R&amp;S. I was planning to study them now, and take the exams in my last university year. The main reason I wanted to have those certification (or the CCNA R&amp;S) in my resume is to approve that I understand networking. \n\n\nSo, I got the \"CompTIA Network+ All-In-One Exam Guide, Sixth Edition(Exam N10-006)\" Mike Meyer's book, and got shocked by how much information is need to be memorized in order to pass the exam, and understanding that information (which is the only needed in the real world field) isn't enough to. And, this is just the basic network+ cert., so the CCNA R&amp;S has much more to memorize (probably 1000+ pages). Also, all that memorization is not needed in the security/hacking field, I just need to understand TCP/IP, know how to pivot, understand wireshark, understand how firewalls work..I don't need to know how to configure 100+ switches with 30+ firewalls, and some load balancers, that is the networking man job. I understand that to hack a network protected using a firewall, and an IPS for example, i need to understand both of them in order to hack it, and that's what I am gonna do, I want to understand and memorize what's needed for hacking, but not 4000+ pages of networking at least. And i am gonna deploy that practically in labs. I am gonna configure switches, routers, firewalls, IPS &amp; IDS.., but I am not gonna memorize tons of things, just to pass a certification, that I am not gonna use, neither in the job, nor in my own hacking journey.\n\n\nThen, I kept thinking, is studying them using \"books maybe + cybrary + labs -packet tracer, virtual networks using vmware workstation-\" enough to fill this gap ? I checked indeed.com to see some job posts, and what they require, and no one required having those certifications, just a few required understanding TCP/IP.\n\n\nThis same thing applies to Microsoft, and Red Hat, I planned to get some of their certifications, to approve that I understand Windows and Linux, but i think there is no need anymore. I can self-study them without getting a certification, for my knowledge base only, and focus on the security certifications, so I can now achieve the CEH (just to pass the HR), OSCP, maybe elearnsecurity (their courses are good, but their certifications are not well known unfortunately, so I don't know if it will help me getting a good job), and much more.\n\n\nAnd I thought, doesn't achieving OSCP approve that I understand the needed knowledge to do a penetration test ? Such as TCP/IP understanding, wireshark, linux, windows, scripting...as this knowledge is required to pass it! So, I can approve it to the employer this way.\n\n\nSo now, I can achieve some important security certifications within my bachelor years, then I can join a master security degree if it's worth it (in USA or EUROPE) OR I will get a good security-related job immediately after graduation (I don't study in USA or Europe currently, but I would like to work there, as the people there appreciate Information Security much more than here), and then, I will start harvesting SANS certifications -i wish i can afford them on my own now-, and after some years, I will get the CISSP, and maybe then I can work as a CISO! Which is my goal, to be a CISO (As I know, it's the most paying and prestigious job in this field).\n\n\nIn the same time, I will study security books as much as I can, I will build my own lab, I will use vulnerable machines such as the vulnhub's ones, i will use ctf365.com, I will stay up to date with security news and vulnerabilities, I will donate to penetration test local companies, i will attend CTFs, conferences, and bug bounty programs, I MAY make a blog, and I will do my best to fill up my resume (I will make a seperate post to gather as much as possible on what things can help my resume).\n\n\nYou may ask, why did I post this if I already made my decision ? I didn't. I am still worried what is the right thing to do, that's why I need your help. I don't know what is better. I don't know if my path will work or not.\n\n\nI apologize for the long post. I hope you answer my following questions, and I appreciate any additional advice and suggestions. I hope you correct and direct me to the right path. My whole future depends on your help.\n\n\n1. Can I get a security-related job immediately after graduation (I mean my first job is security-related one) with a CS BA degree, CEH cert., OSCP cert., and the self-study stuff that can be put on the resume (such as: books, online courses, achievements, donations, a blog, CTFs, conferences, bug bountry programs...) ?\n2. Is my plan/path realistic ? \n3. Can the CISO level be achieved this path ? (I think I need a management/Business certification to be a CISO)\n4. Additional notes, advice, and suggestions are appreciated.\n\n\nThanks in advance.\n\n\n-LonVenu | Reddit",
        "title": "Networking for Information Security/Penetration Testing",
        "score": 6,
        "id": "4tfbz6",
        "commsNum": 12,
        "timeStamp": "2016/07/18-07:03:47",
        "author_name": "LonVenu",
        "is_self": true,
        "locked": false,
        "num_comments": 12,
        "over_18": false,
        "spoiler": null,
        "subreddit": "malware",
        "stickied": false,
        "url": "https://www.reddit.com/r/Malware/comments/4tfbz6/networking_for_information_securitypenetration/"
    },
    "posts": {}
}