{
    "op": {
        "upvote_ratio": null,
        "selftext": "**Overview**\n\nLogRhythm is looking for a Senior Security Research Engineer that will help drive the R&amp;D efforts of the LogRhythm Labs team; taking threat research (attackers and their tactics, techniques, and procedures) and turning that into actionable intelligence for our SIEM. This critical role offers the opportunity to join the fastest growing private SIEM solution provider and join a team whose production continues to have a significant impact on the growth of LogRhythm.\n\nThe ideal candidate will be driven in the security industry with an \"executioner\" mindset. If you’ve worked in Incident Response, Threat Intelligence, Penetration Testing, and have a passion towards helping organizations do the right thing to protect themselves, this is an opportunity to work with the most advanced SIEM solution in the world to develop content that operationalizes threat intelligence.\n\n**Please note:** This position is open to remote work for a short duration but will ultimately be headquartered in Boulder, CO. Relocation will be something to consider. There are options for relocation assistance in certain situations.\n\nLogRhythm is proud to be an equal opportunity employer. We are committed to equal opportunity regardless of race, color, ancestry, religion, gender, gender identity, genetic information, parental or pregnancy status, national origin, sexual orientation, age, citizenship, marital status, disability, or Veteran status.\n\nPlease apply through the link provided - https://logrhythm.com/career-application/?gh_jid=151538\n\n**Qualifications**\n\n* Deep technical expertise in network defense technologies, forensic tools, threat intelligence, and active defense technologies.\n* Deep understanding of vulnerabilities, exploits and the latest attack vectors. You have indepth knowledge of IT infrastructure and its role in security; hands-on experience with host, network, and user technologies, to include the analytics that drive them.\n* Understanding of the latest attack vectors and are constantly thinking about how to operationalize it - for great good of the security community.\n* Experience actively interacting with the security community utilizing your extensive research capabilities. This is also utilized to contribute to new product development.\n* Incident response experience in which you routinely perform in-depth forensics analysis against network data, system data, and log data.\n* A research oriented approach to this that has been demonstrated in a successful platform.\n* A few of these certifications CISSP, OSCP OSEE , CISA, CEH, GCIA, GCIH, Security +",
        "title": "LogRhythm - Senior Security Research Engineer",
        "score": 0,
        "id": "4ul5fn",
        "commsNum": 2,
        "timeStamp": "2016/07/25-14:52:17",
        "author_name": "SparksRhythm",
        "is_self": true,
        "locked": false,
        "num_comments": 2,
        "over_18": false,
        "spoiler": null,
        "subreddit": "malware",
        "stickied": false,
        "url": "https://www.reddit.com/r/Malware/comments/4ul5fn/logrhythm_senior_security_research_engineer/"
    },
    "posts": {}
}