{
    "op": {
        "upvote_ratio": null,
        "selftext": "A friend of mine, via her Android 6.0 device, yesterday (15.11.2016) received an odd looking message from a host at `jimdo.com`. She clicked on it, and was ultimately redirected her to a porno site. The next day (16.11.2016), her Facebook account was used to send out hundreds of messages for a different host at `jimdo.com`. \n\nI have yet to inspect the Android device, but I have found that her Facebook account was not per se hacked. There were only two currently in-use sessions -- her Android device and the Windows host I had logged in with under her credentials (with explicit permission of course). There were about 7 or 8 other devices with valid sessions, but none had been active this year. She reports she had not used the Windows browser to access Facebook since the 12th of November.\n\nThis leaves me with the tentative conclusion that Google Chrome on Android itself has the vulnerability. At this time, the only info I have is that it's version 6.0. \n\nI also clicked on her message. I also got redirected to the Prono site. However, there is no indication (yet) that my Facebook account has been subject to unauthorized use. (Just in case, I beefed up security and dropped the current session). One difference may be: I used Facebook within the browser and not as a separate app. Another difference: I'm using Android 5.0 (Jan 1 16 security update). \n\nOn Windows, I used Chrome with a new profile to visit the `jimdo.com` site. I used a new profile and a secondary Facebook account. In this environment, a visit to that site _did not_ redirect me. Thus, I suspect this website or one of its javascript providers has been hacked with a malware payload. HTTP Trace indicated visits to the following hosts:\n\n    a.jimdo.com\n    assets.jimstatic.com\n    delivery.brokerbabe.com\n    fonts.googleapis.com\n    fonts.gstatic.com\n    image.jimcdn.com\n    u.jimcdn.com\n    widget.supercounters.com\n    www.googletagmanager.com\n    www.supercounters.com\n    zepogihise.jimdo.com\n\nI will note (complain) that Facebook does not publish a way of reporting malicious links sent in messages. You can report posts, you can report \"spam\", but not fishing or malware links. \n\n2016-11-17 Update: Cropped screenshots of messages. http://imgur.com/a/qEM20. The message from one user was always the same. Working hypothesis: hostname of URL morphs with every new infection.\n\n**Update 2**: I tried the link again. Before doing so, I logged out of Facebook (Chrome) and logged in with an alternate account. (Yes, I have such a thing. Shock!) When I clicked on the link from within the Messenger App, the redirections eventually landed me at a fake Facebook login page. The URL shown is:\n\n    http://authentionz-at.videoshareza.xyz/movill.php?lang=en&amp;key=\n\nYesterday, when I tried that link and was logged into Facebook, I did _not_ see this prompt.  The friend claims she did not see or enter the password on this form, and that's something I can confirmed by looking at the Facebook privacy settings: no recent new sessions.  Working hypothesis: **this is a fake fake page, meant to deter security experts** by leading us to the conclusion that the user entered their credentials on this phishing page. \n\nHere is what my Android-Chome history today shows:\n\n    hXXp://zepogihise.jimdo.com\n    hXXp://delivery.brokerbabe.com/r?url=https%3A%2F%2Ft.co%2F4JqmS6x6uT&amp;redirect_back=%2F%2Fdelivery.brokerbabe.com%2F5784%2F%3Fviewerid%3Dpx147937543477d4e582d7a4a727ea454926946%26rt%3D-1%26ref%3D%26tt%3D1%26ptt%3D1#!/xxx\n    hXXp://delivery.brokerbabe.com/r?url=https%3A%2F%2Ft.co%2F4JqmS6x6uT&amp;redirect_back=%2F%2Fdelivery.brokerbabe.com%2F5784%2F%3Fviewerid%3Dpx147937543477d4e582d7a4a727ea454926946%26rt%3D-1%26ref%3D%26tt%3D1%26ptt%3D1\n    hXXps://t.co.4JqmS6x6uT\n    hXXp://authentionz-at.videoshareza.xyz/\n \n(Fake Facebook login)\n\nYesterday, it was different. \n\n    hXXp://zepogihise.jimdo.com\n    hXXp://delivery.brokerbabe.com/r?url=http%3A%2F%2Fhotadultoffers.com%2Fat%2F%3Faffiliate_id%3D164%26trackcode%3Dpx14792987730e83e582c4ed5aa784710794936&amp;redirect_back=%2F%2Fdelivery.brokerbabe.com%2F5784%2F%3Fviewerid%3Dpx14792987730e83e582c4ed5aa784710794936%26rt%3D1%26ref%3D%26tt%3D1%26ptt%3D1#!/xxx\n    hXXp://delivery.brokerbabe.com/r?url=http%3A%2F%2Fhotadultoffers.com%2Fat%2F%3Faffiliate_id%3D164%26trackcode%3Dpx14792987730e83e582c4ed5aa784710794936&amp;redirect_back=%2F%2Fdelivery.brokerbabe.com%2F5784%2F%3Fviewerid%3Dpx14792987730e83e582c4ed5aa784710794936%26rt%3D1%26ref%3D%26tt%3D1%26ptt%3D1\n    hXXp://cmp.qualityoffers.mobi/at/hornypornsluts/single-doubledildo-p3p/?affiliate_id=164&amp;trackcode=px14792987730e83e582c4ed5aa784710794936&amp;cookie=true\n\n",
        "title": "Malware spreading through Android devices, via Facebook messenger.",
        "score": 45,
        "id": "5d9kc4",
        "commsNum": 10,
        "timeStamp": "2016/11/16-06:52:06",
        "author_name": "0theus",
        "is_self": true,
        "locked": false,
        "num_comments": 10,
        "over_18": false,
        "spoiler": false,
        "subreddit": "malware",
        "stickied": false,
        "url": "https://www.reddit.com/r/Malware/comments/5d9kc4/malware_spreading_through_android_devices_via/"
    },
    "posts": {}
}