{
    "op": {
        "upvote_ratio": null,
        "selftext": "I'm doing some research on corrupted PE files and I wanted to hear your thoughts and experiences with them. I've been processing a ton of samples which are essentially corrupted Windows Portable Executable files. They will not run on XP or Windows 7 and they won't run on 32 bit or 64 bit. If I open them in a hex editor, it's very clear that they are missing entire header data structures, the MZ and surrounding data is missing or altered, etc... When I attempt to execute these .exe files, I get errors along the lines of \"This is not a valid Windows executable\" and/or \"This executable cannot be run on this system, it may be designed for 64 bit and you are on a 32 bit or vice versa.\" Not verbatim but that's the general idea.\n\nBasically, I cannot get these to run or operate at all. So the question is, why do they exist? Are they files which could possibly come packaged with other files that when run, repair these files before loading them into memory as a sort of \"obfuscated library file?\" I feel like this is an unlikely scenario.\n\nAnother possibility I was thinking is, perhaps these files are made for a much older version of Windows? I've done some deep study of the PE file format though and am not aware of any previous PE format with altered headers, etc..\n\nEXAMPLE:\n\nSee first a regular PE file that runs fine: http://imgur.com/BqYpheU\n\nNow see the above compared with a specimen file: http://imgur.com/zRcLUB9\n\nFinally, I was able to locate \"PE\" much further down then normal, amongst a bunch of binary data: http://imgur.com/4mtc6MH\n\nThis is all just one example but this is the kind of thing I'm talking about.",
        "title": "Can Corrupted PE malware be run in certain circumstances?",
        "score": 13,
        "id": "69cphv",
        "commsNum": 5,
        "timeStamp": "2017/05/04-21:51:33",
        "author_name": "TheOnlyRealTodd",
        "is_self": true,
        "locked": false,
        "num_comments": 5,
        "over_18": false,
        "spoiler": false,
        "subreddit": "malware",
        "stickied": false,
        "url": "https://www.reddit.com/r/Malware/comments/69cphv/can_corrupted_pe_malware_be_run_in_certain/"
    },
    "posts": {}
}