{
    "op": {
        "upvote_ratio": null,
        "selftext": "",
        "title": "Kaspersky Lab Has Been Working With Russian Intelligence",
        "score": 58,
        "id": "6moan8",
        "commsNum": 31,
        "timeStamp": "2017/07/11-11:47:53",
        "author_name": "A_Lazko",
        "is_self": false,
        "locked": false,
        "num_comments": 31,
        "over_18": false,
        "spoiler": false,
        "subreddit": "malware",
        "stickied": false,
        "url": "https://www.bloomberg.com/news/articles/2017-07-11/kaspersky-lab-has-been-working-with-russian-intelligence"
    },
    "posts": {
        "dlp6lmw": {
            "comment": "This is the best tl;dr I could make, [original](https://www.bloomberg.com/news/articles/2017-07-11/kaspersky-lab-has-been-working-with-russian-intelligence?) reduced by 89%. (I'm a bot)\n*****\n&gt; While the U.S. government hasn&amp;#039;t disclosed any evidence of the ties, internal company emails obtained by Bloomberg Businessweek show that Kaspersky Lab has maintained a much closer working relationship with Russia&amp;#039;s main intelligence agency, the FSB, than it has publicly admitted.\n\n&gt; Kaspersky Lab would also cooperate with internet hosting companies to locate bad actors and block their attacks, while assisting with &amp;quot;Active countermeasures,&amp;quot; a capability so sensitive that Kaspersky advised his staff to keep it secret.\n\n&gt; &amp;quot;This is quite useless to find any real evidence, any real cases where Kaspersky Lab would violate their privacy policies and transfer some data from U.S. customers, from U.S. enterprise clients, to Russian intelligence or FSB,&amp;quot; says Oleg Demidov, a consultant for researcher PIR Center in Moscow who studies Russian cyberattacks.\n\n\n*****\n[**Extended Summary**](http://np.reddit.com/r/autotldr/comments/6u1p86/kaspersky_lab_has_been_working_with_russian/) | [FAQ](http://np.reddit.com/r/autotldr/comments/31b9fm/faq_autotldr_bot/ \"Version 1.65, ~192033 tl;drs so far.\") | [Feedback](http://np.reddit.com/message/compose?to=%23autotldr \"PM's and comments are monitored, constructive feedback is welcome.\") | *Top* *keywords*: **Kaspersky**^#1 **company**^#2 **U.S.**^#3 **Lab**^#4 **Russian**^#5",
            "timeStamp": "2017/08/16-05:31:20",
            "id": "dlp6lmw",
            "is_submitter": false,
            "link_id": "t3_6moan8",
            "parent_id": "t3_6moan8",
            "score": 1,
            "stickied": false,
            "author_name": "autotldr"
        },
        "dk58xt3": {
            "comment": "They aren't even all directly related.  Some of it, like the senate document I linked, are about things that are only tangentially related - but of course the immediate impression people get if they don't read through them is that all of the documents are supporting Crowdstrike.\n\n&gt; There are reasons to nail Russia to a cross, but I am not certain that the DNC hack is it. There are too many bad judgements and assumptions made by Crowdstrike to really accept this. Same with the Sony Hack to be honest.\n\nAbsolutely.  While I don't doubt that Russia had people probing and potentially even gaining access, that doesn't mean that they were involved in the leaks.  It's possible, but with the rise of insider threats, the insecurity in the majority of networks, and incompetence of end users, there are a ton of ways those documents could have been accessed.  It's not even mutually exclusive - it's entirely possible that what Crowdstrike claims is proof of Russian access is true, but that doesn't mean that there wasn't a leaker either.  And those possibilities are before even bringing up repurposed malware.\n\nIronically, if they continue to operate in the same way I wouldn't be surprised if we hear about the CIA hitting US businesses (etc) due to Vault 7.\n\nIn any case, sadly, most people aren't willing to hear any of this.  It goes back to the politics.  People are being sucked into hyper-partisanship, and naturally put themselves into echo chambers on social media - so unless you're reinforcing their pre-established views... you're wrong, a troll, etc.  It's sad, but it's going to be a long while yet before we can even begin to address the wedges that have been driven.  Until then, everyone with a dissenting opinion is either a shill or an idiot.",
            "timeStamp": "2017/07/12-17:28:13",
            "id": "dk58xt3",
            "is_submitter": false,
            "link_id": "t3_6moan8",
            "parent_id": "t1_dk52muc",
            "score": 1,
            "stickied": false,
            "author_name": "chip_ninja"
        },
        "dk52muc": {
            "comment": "Thays interesting. I hadnt realized that they did a circular referencing of supportive articles like that. \n\nI agree wholeheartedly with you. It can be difficult teaching the public these matters of tech. The public is going to follow the \"appeal to authority\" arguments because they just dont have the technical background to truly evaluate findings and methodology. I am glad to find another person in the wild who is questioning the finding without all the conspiracy hubbub being attached to it, so tip of the hat to you. I hope you remain vocal on this issue and teach others why there are valid reasons to question this particular portion of the Russian controversy. There are reasons to nail Russia to a cross, but I am not certain that the DNC hack is it. There are too many bad judgements and assumptions made by Crowdstrike to really accept this. Same with the Sony Hack to be honest. ",
            "timeStamp": "2017/07/12-15:15:55",
            "id": "dk52muc",
            "is_submitter": false,
            "link_id": "t3_6moan8",
            "parent_id": "t1_dk4z6o6",
            "score": 2,
            "stickied": false,
            "author_name": "FluentInTypo"
        },
        "dk4z6o6": {
            "comment": "I love talks like that, surprised I hadn't seen that one pop up before.\n\nIn any case, there are a ton of issues not even associated with the attribution itself.  APTs aren't the only ones putting out false information; domestic groups are regularly putting out false news stories as well as the general shoddy clickbait style article.  Making getting accurate information even worse, organizations typically rely in circular reporting.  [Crowdstrike](https://www.crowdstrike.com/blog/bears-midst-intrusion-democratic-national-committee/) points to \"independent articles\" which have been published since they released their findings as supporting information, which in turn point to crowdstrikes initial findings.  \n\nDespite this, everyone talking about attribution typically just has a \"just trust us\" type of attitude - which in an environment where nearly everything is politicized and has an agenda behind it is mindblowing.\n\nI'm not in a position to make a claim one way or the other on the matter personally, but it seems like articles like that one make a lot of leaps.  In all honesty, given the fact that Bloomberg endorsed HRC, Crowdstrike is run by this [\"Cyber\" guy](http://www.joshwieder.net/2015/08/crowdstrike-founder-george-kurtz-made.html)... hell I'd probably be more likely to take Ankit Fadia's input at face value.\n\nWhat I find funny personally though, is we've got senate reports on how \n&gt; \"the more polarized a society, the more vulnerable it is—America in 2016 was highly polarized, with myriad cracks and fissures to drive wedges into. Not old wedges, but improved high-tech wedges that allowed Moscow’s operators to attack their target faster, more reactively, and at far larger scale than ever before.\"  \n\nYet, here people are still trying to argue publicly on who's responsible. Ultimately the attribution doesn't even matter at this point when we're helping the Russian agenda with the petty infighting. Everybody worried about Russia can rest easy now I think - we're driving the wedges for them now so they can probably afford to go hands off.",
            "timeStamp": "2017/07/12-14:10:05",
            "id": "dk4z6o6",
            "is_submitter": false,
            "link_id": "t3_6moan8",
            "parent_id": "t1_dk4qoci",
            "score": 1,
            "stickied": false,
            "author_name": "chip_ninja"
        },
        "dk4qoci": {
            "comment": "They gave a good talk at RSA conference this year :\n\nhttps://www.rsaconference.com/videos/hello-false-flags-the-art-of-deception-in-targeted-attack-attribution",
            "timeStamp": "2017/07/12-11:40:55",
            "id": "dk4qoci",
            "is_submitter": false,
            "link_id": "t3_6moan8",
            "parent_id": "t1_dk4lyj8",
            "score": 1,
            "stickied": false,
            "author_name": "FluentInTypo"
        },
        "dk4purz": {
            "comment": "Cold War 2: Electric Boogaloo.",
            "timeStamp": "2017/07/12-11:27:07",
            "id": "dk4purz",
            "is_submitter": false,
            "link_id": "t3_6moan8",
            "parent_id": "t1_dk45f12",
            "score": 2,
            "stickied": false,
            "author_name": "w00tah"
        },
        "dk4lyj8": {
            "comment": "&gt; And dont forget, there is a reason why America is so desperate to belittle Kaspersky - Kaspersky disagrees with crowdstrikes attribution - rightfully.\n\nAnd you get downvoted (and I probably will as well).  There seem to be a ton of people who don't even understand technology just buying into their explanation, and completely ignoring interpersonal connections which are too convenient to overlook.\n\nThis article, for the most part, is just rehashed content.  It got circulated when people were trying to raise issues with attribution.  I find it pretty convenient that as I start seeing additional information surfacing questioning the attribution's narrative, and again we get the same \"well Russia could be doing this, we just haven't seen the evidence\" narrative as well.",
            "timeStamp": "2017/07/12-10:22:09",
            "id": "dk4lyj8",
            "is_submitter": false,
            "link_id": "t3_6moan8",
            "parent_id": "t1_dk48x14",
            "score": 2,
            "stickied": false,
            "author_name": "chip_ninja"
        },
        "dk4g5xl": {
            "comment": "It's not that simple though. Established malware companies have relationships similar to Kaspersky's with their local federal police force. Numerous US forensics firms have a similar relationship with the FBI, for instance. As much as I want to hear something revealing about Kaspersky, this is not news. ",
            "timeStamp": "2017/07/12-08:44:10",
            "id": "dk4g5xl",
            "is_submitter": false,
            "link_id": "t3_6moan8",
            "parent_id": "t1_dk3z6vw",
            "score": 3,
            "stickied": false,
            "author_name": "saf3"
        },
        "dk4e2vm": {
            "comment": "Well their headquarters are in Moscow and they are a Russian company",
            "timeStamp": "2017/07/12-08:07:19",
            "id": "dk4e2vm",
            "is_submitter": false,
            "link_id": "t3_6moan8",
            "parent_id": "t3_6moan8",
            "score": 1,
            "stickied": false,
            "author_name": "klop2031"
        },
        "dk49n66": {
            "comment": "You saying that Malwarebytes can't work with the CIA to stop cyber threats? ",
            "timeStamp": "2017/07/12-06:40:44",
            "id": "dk49n66",
            "is_submitter": false,
            "link_id": "t3_6moan8",
            "parent_id": "t3_6moan8",
            "score": 2,
            "stickied": false,
            "author_name": "madogson"
        },
        "dk48x4z": {
            "comment": "Non-Mobile link: https://en.wikipedia.org/wiki/Unit_8200\n***\n^HelperBot ^v1.1 ^/r/HelperBot_ ^I ^am ^a ^bot. ^Please ^message ^/u/swim1929 ^with ^any ^feedback ^and/or ^hate. ^Counter: ^90453",
            "timeStamp": "2017/07/12-06:24:39",
            "id": "dk48x4z",
            "is_submitter": false,
            "link_id": "t3_6moan8",
            "parent_id": "t1_dk48x14",
            "score": 1,
            "stickied": false,
            "author_name": "HelperBot_"
        },
        "dk48x14": {
            "comment": "Are you aware of how many ex-cia agents work in the american tech industry? Or that our tech industry works with the American government as a matter of course?\n\nOr, to look at one of our allies, how many israeli ex-8200 members are in cyber security firms?\n\nhttps://en.m.wikipedia.org/wiki/Unit_8200\n\nI fail to see how this is an issue. If simply being a member of the intelligence community was a bad thing, most of our major cyber security companies should be shut down immediately. \n\nAnd dont forget, there is a reason why America is so desperate to belittle Kaspersky - Kaspersky disagrees with crowdstrikes attribution - rightfully.",
            "timeStamp": "2017/07/12-06:24:36",
            "id": "dk48x14",
            "is_submitter": false,
            "link_id": "t3_6moan8",
            "parent_id": "t1_dk39j0r",
            "score": 2,
            "stickied": false,
            "author_name": "FluentInTypo"
        },
        "dk485y0": {
            "comment": "[deleted]",
            "timeStamp": "2017/07/12-06:07:01",
            "id": "dk485y0",
            "is_submitter": false,
            "link_id": "t3_6moan8",
            "parent_id": "t1_dk38obo",
            "score": 1,
            "stickied": false,
            "author_name": "[deleted]"
        },
        "dk45f12": {
            "comment": "Cold War 2 ",
            "timeStamp": "2017/07/12-04:50:41",
            "id": "dk45f12",
            "is_submitter": false,
            "link_id": "t3_6moan8",
            "parent_id": "t1_dk3w9l4",
            "score": 2,
            "stickied": false,
            "author_name": "DoNotStopThinking"
        },
        "dk3z6vw": {
            "comment": "dispute between Apple and FBI about encryption shows that there is a line which any company cannot cross cooperating with law enforcemement",
            "timeStamp": "2017/07/12-00:25:36",
            "id": "dk3z6vw",
            "is_submitter": true,
            "link_id": "t3_6moan8",
            "parent_id": "t1_dk3u8w0",
            "score": 2,
            "stickied": false,
            "author_name": "A_Lazko"
        },
        "dk3x0n7": {
            "comment": "File this under &lt;not surprising&gt;",
            "timeStamp": "2017/07/11-23:03:25",
            "id": "dk3x0n7",
            "is_submitter": false,
            "link_id": "t3_6moan8",
            "parent_id": "t3_6moan8",
            "score": 2,
            "stickied": false,
            "author_name": "SpotOnTheRug"
        },
        "dk3w9l4": {
            "comment": "yeah but were back in the cold war again",
            "timeStamp": "2017/07/11-22:38:20",
            "id": "dk3w9l4",
            "is_submitter": false,
            "link_id": "t3_6moan8",
            "parent_id": "t1_dk3u8w0",
            "score": 7,
            "stickied": false,
            "author_name": "sparc64"
        },
        "dk3u8w0": {
            "comment": "The report lists Kaspersky working with Russian Intelligence to identify cyber threats and trace the attackers. \n\nI could be wrong, but everything described in this article sounds like legitimate cooperation with law enforcement. ",
            "timeStamp": "2017/07/11-21:37:01",
            "id": "dk3u8w0",
            "is_submitter": false,
            "link_id": "t3_6moan8",
            "parent_id": "t3_6moan8",
            "score": 18,
            "stickied": false,
            "author_name": "rick2g"
        },
        "dk3rs02": {
            "comment": "The evidence of this is thin at best: https://twitter.com/josephfcox/status/884767422863028224?s=09",
            "timeStamp": "2017/07/11-20:32:37",
            "id": "dk3rs02",
            "is_submitter": false,
            "link_id": "t3_6moan8",
            "parent_id": "t3_6moan8",
            "score": 1,
            "stickied": false,
            "author_name": "mikeydangerous"
        },
        "dk3n5es": {
            "comment": "Was this not generally known? I mean, its not exactly secret.",
            "timeStamp": "2017/07/11-18:47:53",
            "id": "dk3n5es",
            "is_submitter": false,
            "link_id": "t3_6moan8",
            "parent_id": "t3_6moan8",
            "score": 1,
            "stickied": false,
            "author_name": "sorklin"
        },
        "dk3mxx9": {
            "comment": "That's really interesting, thanks for linking that.",
            "timeStamp": "2017/07/11-18:43:13",
            "id": "dk3mxx9",
            "is_submitter": false,
            "link_id": "t3_6moan8",
            "parent_id": "t1_dk3mvir",
            "score": 2,
            "stickied": false,
            "author_name": "fuckallofyouforreal"
        },
        "dk3mvir": {
            "comment": "&gt;Talking about russian hacking\n\n&gt;duke it out\n\nhttps://www.f-secure.com/documents/996508/1030745/dukes_whitepaper.pdf\n\nHa !",
            "timeStamp": "2017/07/11-18:41:45",
            "id": "dk3mvir",
            "is_submitter": false,
            "link_id": "t3_6moan8",
            "parent_id": "t1_dk3bpq4",
            "score": 3,
            "stickied": false,
            "author_name": "Djuzuh"
        },
        "dk3c8q5": {
            "comment": "excellent sense of humor )\nI'd prefer for someone to turn the light off on Putin and his whole kgb-system",
            "timeStamp": "2017/07/11-14:54:22",
            "id": "dk3c8q5",
            "is_submitter": true,
            "link_id": "t3_6moan8",
            "parent_id": "t1_dk3c13v",
            "score": 1,
            "stickied": false,
            "author_name": "A_Lazko"
        },
        "dk3c13v": {
            "comment": "So long as they wait for it to cool off. I'd rather go toe to toe with Putin in a judo match than sit out the rest of the summer with no AC.",
            "timeStamp": "2017/07/11-14:50:23",
            "id": "dk3c13v",
            "is_submitter": false,
            "link_id": "t3_6moan8",
            "parent_id": "t1_dk3bxzx",
            "score": 1,
            "stickied": false,
            "author_name": "fuckallofyouforreal"
        },
        "dk3bxzx": {
            "comment": "with all the eyes on Russia for hacking US elections, Petya virus, other hacking attacks on power grids in Ukraine and the US, somehow I personally feel it's going to happen rather sooner than later",
            "timeStamp": "2017/07/11-14:48:48",
            "id": "dk3bxzx",
            "is_submitter": true,
            "link_id": "t3_6moan8",
            "parent_id": "t1_dk3bpq4",
            "score": 3,
            "stickied": false,
            "author_name": "A_Lazko"
        },
        "dk3bpq4": {
            "comment": "Right. Well when shtf, KAV will have to duke it out the with CIA/NSA's preinstalled firmware.  I guess we'll know when the lights go off.",
            "timeStamp": "2017/07/11-14:44:34",
            "id": "dk3bpq4",
            "is_submitter": false,
            "link_id": "t3_6moan8",
            "parent_id": "t1_dk3bcbj",
            "score": 2,
            "stickied": false,
            "author_name": "fuckallofyouforreal"
        },
        "dk3bcbj": {
            "comment": "most likely it can be looked like some coincidence like this one: \nhttp://www.newyorker.com/news/news-desk/are-russian-operatives-attacking-putin-critics-in-the-us\n\nwhat I would not exclude is that Kaspersky AntiVirus Co was initially created to get into Western world and be ready to control processes or even do some harm\n\n",
            "timeStamp": "2017/07/11-14:37:33",
            "id": "dk3bcbj",
            "is_submitter": true,
            "link_id": "t3_6moan8",
            "parent_id": "t1_dk3airb",
            "score": 3,
            "stickied": false,
            "author_name": "A_Lazko"
        },
        "dk3airb": {
            "comment": "Good point. E.K. will probably be drinking nuclear tea at some point.",
            "timeStamp": "2017/07/11-14:22:05",
            "id": "dk3airb",
            "is_submitter": false,
            "link_id": "t3_6moan8",
            "parent_id": "t1_dk39ut2",
            "score": 1,
            "stickied": false,
            "author_name": "fuckallofyouforreal"
        },
        "dk39ut2": {
            "comment": "there are so many Russian billionairs who thought they would be fine but they were not..  there are still questions about Berezovsky's last day for example",
            "timeStamp": "2017/07/11-14:09:44",
            "id": "dk39ut2",
            "is_submitter": true,
            "link_id": "t3_6moan8",
            "parent_id": "t1_dk39n8s",
            "score": 6,
            "stickied": false,
            "author_name": "A_Lazko"
        },
        "dk39n8s": {
            "comment": "Yeah i know about that stuff, but he had to know this day was coming and probably preferred not to have to go through it. But he's a billionaire and he'll be fine. ",
            "timeStamp": "2017/07/11-14:05:58",
            "id": "dk39n8s",
            "is_submitter": false,
            "link_id": "t3_6moan8",
            "parent_id": "t1_dk39j0r",
            "score": 5,
            "stickied": false,
            "author_name": "fuckallofyouforreal"
        },
        "dk39j0r": {
            "comment": "Eugene Kaspersky himself \"..graduated from The Technical Faculty of the KGB Higher School in 1987 with a degree in mathematical engineering and computer ...\" (Wiki)\n- So everything maybe went even simpler -\n\"There are no former KGB agents\" as the saying goes",
            "timeStamp": "2017/07/11-14:03:48",
            "id": "dk39j0r",
            "is_submitter": true,
            "link_id": "t3_6moan8",
            "parent_id": "t1_dk38obo",
            "score": 11,
            "stickied": false,
            "author_name": "A_Lazko"
        },
        "dk38obo": {
            "comment": "Presumably Putin made Kaspersky an offer they couldn't refuse. That's too bad. They make a good product.",
            "timeStamp": "2017/07/11-13:48:39",
            "id": "dk38obo",
            "is_submitter": false,
            "link_id": "t3_6moan8",
            "parent_id": "t3_6moan8",
            "score": 10,
            "stickied": false,
            "author_name": "fuckallofyouforreal"
        },
        "dk37gmx": {
            "comment": "Go figure. ",
            "timeStamp": "2017/07/11-13:27:17",
            "id": "dk37gmx",
            "is_submitter": false,
            "link_id": "t3_6moan8",
            "parent_id": "t3_6moan8",
            "score": 17,
            "stickied": false,
            "author_name": "foreimean5imeanfire"
        }
    }
}