{
    "op": {
        "upvote_ratio": null,
        "selftext": "[removed]",
        "title": "How Do I Get Rid Of Adware That Installs On Startup?",
        "score": 0,
        "id": "6nlwcr",
        "commsNum": 23,
        "timeStamp": "2017/07/16-05:06:48",
        "author_name": "catonthemat12",
        "is_self": true,
        "locked": false,
        "num_comments": 23,
        "over_18": false,
        "spoiler": false,
        "subreddit": "malware",
        "stickied": false,
        "url": "https://www.reddit.com/r/Malware/comments/6nlwcr/how_do_i_get_rid_of_adware_that_installs_on/"
    },
    "posts": {
        "dkc2x42": {
            "comment": "Agreed, different views and expectations. I came on strong at first, I'm sorry about that. I just viewed OP in a different light.\n\nYour points are valid, and sometimes a reinstall is easiest, especially in a corporate environment. ",
            "timeStamp": "2017/07/17-08:13:39",
            "id": "dkc2x42",
            "is_submitter": false,
            "link_id": "t3_6nlwcr",
            "parent_id": "t1_dkbipqh",
            "score": 1,
            "stickied": false,
            "author_name": "LightningRurik"
        },
        "dkbipqh": {
            "comment": "I guess it ultimately comes down to the perceived skill level of the user. I'm still not too convinced that there are many users who can remove the adware from running at startup, but can't successfully reinstall an os. \n\nPeople seem to have pretty different view than me on the kind of trust they want to have on their platform. Each to his own, then. ",
            "timeStamp": "2017/07/16-21:01:36",
            "id": "dkbipqh",
            "is_submitter": false,
            "link_id": "t3_6nlwcr",
            "parent_id": "t1_dkb607b",
            "score": 1,
            "stickied": false,
            "author_name": "de_hatron"
        },
        "dkbigjr": {
            "comment": "Since you didn't contribute anything useful to this discussion, it's hilarious that you seem somehow tired to some imaginary argument. \n\nThe other guy actually has counterpoints, you have silly comparisons and hyperboles, which you for some reason mistake for an actual discussion. ",
            "timeStamp": "2017/07/16-20:54:46",
            "id": "dkbigjr",
            "is_submitter": false,
            "link_id": "t3_6nlwcr",
            "parent_id": "t1_dkb4iw9",
            "score": 1,
            "stickied": false,
            "author_name": "de_hatron"
        },
        "dkb607b": {
            "comment": "If you tell someone to reinstall, they'll do the Windows \"Reset this PC\". Unless someone was very confident in their data backups, your typical home user will select the option to retain their user files. Given the option of the possibility of losing any single piece of user data, many choose to remove the malware manually. There are thousands of users at Bleeping Computer who started off in his same shoes, all with infections that can be identified and removed with some guidance. And there's plenty of people available to help give that guidance. \n\nThat said, this isn't the sub to give specific instructions, even though someone else did give him some pointers. \n\nIf someone is willing to come into a /r/ and ask a question, they're at least open to a long answer. Given the right context (and sub).",
            "timeStamp": "2017/07/16-16:01:47",
            "id": "dkb607b",
            "is_submitter": false,
            "link_id": "t3_6nlwcr",
            "parent_id": "t1_dkb44fc",
            "score": 1,
            "stickied": false,
            "author_name": "LightningRurik"
        },
        "dkb4iw9": {
            "comment": "Edit: Fuck it, I don't feel like arguing with randos in a sub with like 5 people.\n\nWipe it all. Hell, buy a new computer actually. How do you know the firmware hasn't been compromised?\n\nHell, there may be a supply chain breach. Better just source your own silicon and build from scratch in a Faraday cage. \n\n\n\n\n\n\n",
            "timeStamp": "2017/07/16-15:28:59",
            "id": "dkb4iw9",
            "is_submitter": false,
            "link_id": "t3_6nlwcr",
            "parent_id": "t1_dkb1ulx",
            "score": 2,
            "stickied": false,
            "author_name": "Clit_Trickett"
        },
        "dkb44fc": {
            "comment": "I personally would not just reinstall anything without the forensic procedures I mentioned earlier. Even then, I'd obviously start with a fresh image. Now OP obviously can't do any of that, since if he could he would not be asking. \n\nI don't know what you think full reinstall means. Why the hell would someone reinstall os in this scenario without wiping everything before it? You probably can't avoid backing up some of your files, but it's still way more secure than just hoping that OP is capable of spotting everything. \n\nYou didn't even give specific instructions to him, btw.  Your solution doesn't actually rule out anything, so I don't think why you seem to think mine has to. ",
            "timeStamp": "2017/07/16-15:20:23",
            "id": "dkb44fc",
            "is_submitter": false,
            "link_id": "t3_6nlwcr",
            "parent_id": "t1_dkb3gw7",
            "score": 1,
            "stickied": false,
            "author_name": "de_hatron"
        },
        "dkb3gw7": {
            "comment": "No, you're waiting to see if you can win an Internet argument. I gave my reasoning, and I stick by it, even with you moving the goal posts. If you reinstall the OS, user data stays behind. And you have not yet ruled out that the user data was responsible for the infection. You're just crossing your fingers and hoping that the reinstall will fix.",
            "timeStamp": "2017/07/16-15:06:17",
            "id": "dkb3gw7",
            "is_submitter": false,
            "link_id": "t3_6nlwcr",
            "parent_id": "t1_dkb22bm",
            "score": 2,
            "stickied": false,
            "author_name": "LightningRurik"
        },
        "dkb22bm": {
            "comment": "We seem to have a different definition for reinstall, if you think that the extensions remain after it.  \n\nI'm still waiting for an explanation of why my solution was horrible. ",
            "timeStamp": "2017/07/16-14:36:21",
            "id": "dkb22bm",
            "is_submitter": false,
            "link_id": "t3_6nlwcr",
            "parent_id": "t1_dkawheb",
            "score": 1,
            "stickied": false,
            "author_name": "de_hatron"
        },
        "dkb1ulx": {
            "comment": "And replacing tires when your rims are deformed won't fix anything. See, I also can make inane comparisons.  \n\nI don't know what the hell you guys are doing with your computers, but malware shouldn't just get on your computers so often that reinstall is not an option because it's a hassle.  \n\nAnd can you say what crystal ball you're using to know the fact that it's a single piece of adware? ",
            "timeStamp": "2017/07/16-14:32:00",
            "id": "dkb1ulx",
            "is_submitter": false,
            "link_id": "t3_6nlwcr",
            "parent_id": "t1_dkaz87t",
            "score": 1,
            "stickied": false,
            "author_name": "de_hatron"
        },
        "dkaz87t": {
            "comment": "Wiping and reinstalling because of adware is like buying a new car if you get a flat. ",
            "timeStamp": "2017/07/16-13:36:31",
            "id": "dkaz87t",
            "is_submitter": false,
            "link_id": "t3_6nlwcr",
            "parent_id": "t1_dkap465",
            "score": 2,
            "stickied": false,
            "author_name": "Clit_Trickett"
        },
        "dkaz3po": {
            "comment": "[deleted]",
            "timeStamp": "2017/07/16-13:33:50",
            "id": "dkaz3po",
            "is_submitter": false,
            "link_id": "t3_6nlwcr",
            "parent_id": "t3_6nlwcr",
            "score": 1,
            "stickied": false,
            "author_name": "[deleted]"
        },
        "dkawheb": {
            "comment": "Agreed, you would not find a malicious browser extension in startup scripts, because it exists in current-user-land. Therefore, reinstalling the OS wouldn't remove it. It would come right back after the reinstall. ",
            "timeStamp": "2017/07/16-12:39:09",
            "id": "dkawheb",
            "is_submitter": false,
            "link_id": "t3_6nlwcr",
            "parent_id": "t1_dkavb6p",
            "score": 2,
            "stickied": false,
            "author_name": "LightningRurik"
        },
        "dkavb6p": {
            "comment": "It doesn't need to be an APT. Tell me, where in the startup scripts you can see a malicious browser extension? I bet it takes more than five minutes to check your browsers for unwanted plugins, even from you.",
            "timeStamp": "2017/07/16-12:13:55",
            "id": "dkavb6p",
            "is_submitter": false,
            "link_id": "t3_6nlwcr",
            "parent_id": "t1_dkau74u",
            "score": 1,
            "stickied": false,
            "author_name": "de_hatron"
        },
        "dkau74u": {
            "comment": "OK, now you're just stretching to win an Internet argument. This is adware, not APT. This is identifying a single executable out of 30, not forensics and RE. But, hey, they'll like your advice over in techsupport.",
            "timeStamp": "2017/07/16-11:49:59",
            "id": "dkau74u",
            "is_submitter": false,
            "link_id": "t3_6nlwcr",
            "parent_id": "t1_dkaruwz",
            "score": 2,
            "stickied": false,
            "author_name": "LightningRurik"
        },
        "dkaruwz": {
            "comment": "&gt; Most safe, sure. If you like carpet bombing to kill a spider.\n\nThat's a completely ridiculous hyperbole.\n\n&gt; Reinstallation of Windows is a last resort hail mary. It's a horrible choice because it does not identify when the malware was installed nor how it was installed.\n\nSo image the disk and memory and do forensics separately, if you must find out the cause. There's zero reason to keep using an infected system.\n\n&gt; Without identifying the malware and how it got onto the system, you're risking re-infecting yourself over and over again. Hence, horrible advice, and goes against the spirit of this sub.\n\nIt's not horrible advice. A beginner or even semi-pro user can't actually do forensics and reverse engineering, so it's completely ridiculous to assume they could possibly find even common persistence mechanisms.\n\n&gt;It's just singular binaries, DLLs, scripts. Find the one causing persistence and you can defang it. Find where it sits, and other files created at the same time. A quick Windows search and you can nuke from there. What's left over are artifacts that are benign. You don't need to search every possible place where malware might hide, you just need to find the one place it is running from. \n\nBecause malware can't alter time stamps and download more malware, right? Good luck, when your account passwords are stolen because you missed something.\n\n&gt; With an understanding of what may be \"weird\", someone could do this is half an hour. An experienced person can do it in 5. \n\nSo you can see in five minutes, whether or not you have been infected with any malware ever in the world. That's complete bullshit. And you can't even trust the operating system to display accurate information. Windows is full of weird quirks that can be used as a persistence mechanism. And you don't even know what's running in your system, much less where to look.\n\nThe only thing you lose with a reinstall is time. Trying to clean the system puts any new data also at risk.",
            "timeStamp": "2017/07/16-11:00:05",
            "id": "dkaruwz",
            "is_submitter": false,
            "link_id": "t3_6nlwcr",
            "parent_id": "t1_dkaqifo",
            "score": 1,
            "stickied": false,
            "author_name": "de_hatron"
        },
        "dkaqifo": {
            "comment": "Most safe, sure. If you like carpet bombing to kill a spider. Reinstallation of Windows is a last resort hail mary. It's a horrible choice because it does not identify when the malware was installed nor how it was installed. It does not show that it's a file installed by a web browser at 9AM on a Saturday when the OP's child have been using the computer, then leading to a browser history to show that the user was browsing video game cheat forums. Or that the adware was installed at the same time as a popular application used by the OP. Without identifying the malware and how it got onto the system, you're risking re-infecting yourself over and over again. Hence, horrible advice, and goes against the spirit of this sub.\n\nIt's just singular binaries, DLLs, scripts. Find the one causing persistence and you can defang it. Find where it sits, and other files created at the same time. A quick Windows search and you can nuke from there. What's left over are artifacts that are benign. You don't need to search every possible place where malware might hide, you just need to find the one place it is running from. \n\nWith an understanding of what may be \"weird\", someone could do this is half an hour. An experienced person can do it in 5. \n\ne.g. Startup shows an exe signed Coupons For You sitting in C:\\ProgramData. Nuke that whole directory and search registry for anything with that path in it, and nuke them too.",
            "timeStamp": "2017/07/16-10:31:38",
            "id": "dkaqifo",
            "is_submitter": false,
            "link_id": "t3_6nlwcr",
            "parent_id": "t1_dkap465",
            "score": 3,
            "stickied": false,
            "author_name": "LightningRurik"
        },
        "dkap465": {
            "comment": "Why is it horrible advice? How can you know you have actually removed everything? Are you going to spend hours looking every possibly place malware might hide, and still risk the possibility of missing something?\n\nCalling the most safe option horrible makes me think that you don't really know what you're talking about.",
            "timeStamp": "2017/07/16-10:02:20",
            "id": "dkap465",
            "is_submitter": false,
            "link_id": "t3_6nlwcr",
            "parent_id": "t1_dkaod78",
            "score": 1,
            "stickied": false,
            "author_name": "de_hatron"
        },
        "dkaod78": {
            "comment": "No, this is horrible advice. Horrible, horrible. Malware can be removed quite easily, especially most adware. There is an executable somewhere that is started by something. You find that, delete it, and remove it. \n\nGo to Windows task manager, Startup tab, sort by enabled, and find items that shouldn't exist. \n\nAnd this isn't the sub for this, check /r/techsupport.",
            "timeStamp": "2017/07/16-09:46:29",
            "id": "dkaod78",
            "is_submitter": false,
            "link_id": "t3_6nlwcr",
            "parent_id": "t1_dkaff1v",
            "score": 1,
            "stickied": false,
            "author_name": "LightningRurik"
        },
        "dkao20t": {
            "comment": "A place for malware reports and information. This is NOT a place for help with malware removal or various other end-user questions. Please redirect questions related to malware removal to /r/Antivirus or /r/techsupport. Ransomware related questions can be directed to /r/ransomware\n\nYou guys who answer rather than redirecting to the appropriate sub are just as bad. ",
            "timeStamp": "2017/07/16-09:39:51",
            "id": "dkao20t",
            "is_submitter": false,
            "link_id": "t3_6nlwcr",
            "parent_id": "t3_6nlwcr",
            "score": 0,
            "stickied": false,
            "author_name": "quad__damage"
        },
        "dkalfa5": {
            "comment": "This. This is the right answer.",
            "timeStamp": "2017/07/16-08:41:46",
            "id": "dkalfa5",
            "is_submitter": false,
            "link_id": "t3_6nlwcr",
            "parent_id": "t1_dkaik9m",
            "score": 1,
            "stickied": false,
            "author_name": "ziris_"
        },
        "dkaik9m": {
            "comment": "Malware removal is a multi step process.\n\nThis is what I would run, and in this order.\n\n1)Tdsskiller\n\n2)RKill\n\n3)MalwareBytes\n\n4)Adwcleaner\n\n5)Optional, CCleaner. \n\nYou can also run Norton's Power Eraser first, but it generally finds a ton of false positives.",
            "timeStamp": "2017/07/16-07:29:01",
            "id": "dkaik9m",
            "is_submitter": false,
            "link_id": "t3_6nlwcr",
            "parent_id": "t3_6nlwcr",
            "score": 1,
            "stickied": false,
            "author_name": "FizyIzzy"
        },
        "dkaff1v": {
            "comment": "Full reinstall is the only sensible way to get rid of malware. You don't know what else is on the computer once it's compromised.",
            "timeStamp": "2017/07/16-05:25:35",
            "id": "dkaff1v",
            "is_submitter": false,
            "link_id": "t3_6nlwcr",
            "parent_id": "t3_6nlwcr",
            "score": 0,
            "stickied": false,
            "author_name": "de_hatron"
        },
        "dkaf7w7": {
            "comment": "what i found is the it goes in ProgramData/Roaming and in windows files",
            "timeStamp": "2017/07/16-05:17:33",
            "id": "dkaf7w7",
            "is_submitter": true,
            "link_id": "t3_6nlwcr",
            "parent_id": "t3_6nlwcr",
            "score": -1,
            "stickied": false,
            "author_name": "catonthemat12"
        }
    }
}