{
    "op": {
        "upvote_ratio": null,
        "selftext": "Hi all. I'm a software engineer who has been passively studying malware for almost a decade now. Throughout this time I've written some pretty neat stuff and I decided maybe it would be best to share some of my knowledge.\n\n\nI am not a mega expert by all means, but I can hang with the best. My biggest fault is I'm not good at reverse engineering malware, only developing malware (which seems to be opposite of most malware experts?)\n\n\nAnyway, I've been writing an experimental computer virus for a few months now and it's officially transformed into a Rootkit. It has the following functionality:\n\n\n- Completely position independent, makes no direct function calls. Does this by parsing the export address table of NTDLL.dll on load.\n\n\n- Rewrote several windows kernel32 functions to avoid unnecessary function imports (GetLastError, SetLastError, GetEnvironmentVariable, SetFilePointer, LoadLibrary, GetModuleHandle to name a few...)\n\n\n- Programmatically escalates to admin using an unpatched exploit\n\n\n- (work in progress) programmatically escalates to SYSTEM but cloning SYSTEM process security tokens\n\n\n- Hooks user keyboard input on the hardware level\n\n\n- (work in progress) Fractionated Infector cryptor for infecting files\n\n\n- (work in progress) File system octopus injector (fractionated resource file injection\n\n\n- (work in progress) Steals valid Microsoft signatures to avoid AV detection\n\n\n- (work in progress) modified system process block to hide process from task manager\n\n\n- (work in progress) additional evasion stuff...\n\n\n- thread context switching, executes unnecessary junk instructions randomly to make it more difficult to reverse engineer\n\n\n- anti virtualization technology (phony Op codes)\n\n\n- Self debugging mechanism to make it more difficult to debug \n\n\n- all strings are XORd (no strings, cannot sting dump)\n\n\n- original code is packed and compressed\n\n\n\nI thought maybe I should share how I did some of this. What do you guys think?\n\n\nEdit: please look at part 2 of this post: https://www.reddit.com/r/Malware/comments/73uklg/thinking_about_doing_a_twitch_stream_or_something/",
        "title": "Thinking about doing a twitch stream or something discussing malware",
        "score": 63,
        "id": "73q1oq",
        "commsNum": 33,
        "timeStamp": "2017/10/01-19:14:14",
        "author_name": "dwThread",
        "is_self": true,
        "locked": false,
        "num_comments": 33,
        "over_18": false,
        "spoiler": false,
        "subreddit": "malware",
        "stickied": false,
        "url": "https://www.reddit.com/r/Malware/comments/73q1oq/thinking_about_doing_a_twitch_stream_or_something/"
    },
    "posts": {
        "dny968k": {
            "comment": "[removed]",
            "timeStamp": "2017/10/05-10:09:06",
            "id": "dny968k",
            "is_submitter": false,
            "link_id": "t3_73q1oq",
            "parent_id": "t3_73q1oq",
            "score": 1,
            "stickied": false,
            "author_name": "[deleted]"
        },
        "dnxfdl1": {
            "comment": "Stealing the windows certificates actually (to the best of my knowledge) a very new trick written by Mattifestation from Exploit Monday. I haven't had a good chance to review his paper in totality. But it does involve the registry so maybe it's the same thing :)\n\n\nBut yeah, a lot of it is buypassing heuristic analysis and kind of file propagation like --- the idea though is infecting legitimate software without sounding the alarm (obviously) but more sophisticated techniques IME tend to be better suited but not all the time (I'll end up talking about in the talk).\n\n\nWhat you're talking about in the Process Environment Blocks DllBaseName or ImageBaseName member. They're both UNICODE_STRING structures that can be modified. That's been around for awhile buddy :) although kudos for finding that because that info is buried DEEP. I myself only found that trick out about a year or two ago :). I was kind of confused for a second though because i read \"overwrite the PEB...\" and I thought \"wot\". lol I imagined modifying everything. No idea what would happen. Never tried. I think some of it is read only\n\n\nEven if you edit that though you're still present in task manager. This trick is literally modifying the Process Entry List to remove / unlock that particular Process object from the dispatch table itself (is it that dispatch table? I can't remember. I'm probably mega wrong).\n\n",
            "timeStamp": "2017/10/04-20:25:12",
            "id": "dnxfdl1",
            "is_submitter": true,
            "link_id": "t3_73q1oq",
            "parent_id": "t1_dnxdx1v",
            "score": 1,
            "stickied": false,
            "author_name": "dwThread"
        },
        "dnxdx1v": {
            "comment": "Most of the things in your list seem more oriented toward bypassing heuristic and sandbox style detections? Your stealing valid certs has already been done if you google \"subverting Windows trust\" there's a good write up around basically MITMing the Windows trust system via the registry.\n\nRelated to your hiding from task manager bit I recently looked at something as simple as overwriting the PEB data for pretending to be another process and it seems to fool lots of software including Sysmon.\n\nKeep in mind though that using techniques intended to bypass AV heuristics like some of the techniques you mentioned can actually end up being detectable things because they are abnormal in legit software. The old \"the more you try to not standout the more you end up standing out\" can come into play after awhile with some of these things.\n\nDon't get me wrong though I think doing or implementing all that stuff if nothing else is great for making you lean lots of things that can come in handy for RE. As a software dev you actually have a leg up on doing RE because after awhile you'd realize that it becomes easier to visualize the disassembly into a higher level language and visualizing blobs of data into higher level data structures. ",
            "timeStamp": "2017/10/04-19:53:48",
            "id": "dnxdx1v",
            "is_submitter": false,
            "link_id": "t3_73q1oq",
            "parent_id": "t1_dntmdcs",
            "score": 1,
            "stickied": false,
            "author_name": "sysopfb"
        },
        "dnu5n5o": {
            "comment": "Because GetLastError / SetLastError is literally an unnecessary import.\n\n\nOn 32bit windows at FS:0x18 (I think, off the top of my head...) is the THREAD ENVIRONMENT BLOCK and inside that structure is a ULONG variable called LastWin32Error and another NTSTATUS variable called LastNtStatusError. Instead of calling any function you can literally just do\n\n\n- PTEB Teb = NtCurrentTeb(); (or a custom assembly implemention)\n\nthen\n\n\n- Teb-&gt;LastWin32Error = dwError;\n\n\nOr\n\n\n- return Teb-&gt;LastWin32Error;\n\n\nWhy import a function when I can easily do it myself, ya know? :)\n\n\nEdit: 64bit windows is GS:0x30 IIRC for the TEB",
            "timeStamp": "2017/10/02-23:35:56",
            "id": "dnu5n5o",
            "is_submitter": true,
            "link_id": "t3_73q1oq",
            "parent_id": "t1_dntrm1e",
            "score": 1,
            "stickied": false,
            "author_name": "dwThread"
        },
        "dntrm1e": {
            "comment": "Why did you reimplement Get/SetLastError? What's wrong with (dynamically in your case) importing them?",
            "timeStamp": "2017/10/02-17:44:33",
            "id": "dntrm1e",
            "is_submitter": false,
            "link_id": "t3_73q1oq",
            "parent_id": "t3_73q1oq",
            "score": 1,
            "stickied": false,
            "author_name": "anonymous_dev"
        },
        "dntmdcs": {
            "comment": "Interesting. I would love to hear your thoughts on some of my work / ideas / knowledge base. I'm a software engineer and as my post said reverse engineering is my weakness..",
            "timeStamp": "2017/10/02-15:54:19",
            "id": "dntmdcs",
            "is_submitter": true,
            "link_id": "t3_73q1oq",
            "parent_id": "t1_dnthtn1",
            "score": 1,
            "stickied": false,
            "author_name": "dwThread"
        },
        "dntm0iy": {
            "comment": "Thanks by beginner I mean a total beginner learning assbly from ost and after that I will be the taking the re class on ost.\n",
            "timeStamp": "2017/10/02-15:46:58",
            "id": "dntm0iy",
            "is_submitter": false,
            "link_id": "t3_73q1oq",
            "parent_id": "t1_dnt1y80",
            "score": 1,
            "stickied": false,
            "author_name": "insec99"
        },
        "dnthtn1": {
            "comment": "In general or streaming on twitch? My day job is malware RE, I stream unpacking and/or reversing string encoding and C2 encoding and data structures.",
            "timeStamp": "2017/10/02-14:23:38",
            "id": "dnthtn1",
            "is_submitter": false,
            "link_id": "t3_73q1oq",
            "parent_id": "t1_dntfog2",
            "score": 1,
            "stickied": false,
            "author_name": "sysopfb"
        },
        "dntfog2": {
            "comment": "What kind of Vx research have you been doing?",
            "timeStamp": "2017/10/02-13:44:09",
            "id": "dntfog2",
            "is_submitter": true,
            "link_id": "t3_73q1oq",
            "parent_id": "t1_dntfgtg",
            "score": 1,
            "stickied": false,
            "author_name": "dwThread"
        },
        "dntfm0y": {
            "comment": "Check out my second post so I can begin planning plz",
            "timeStamp": "2017/10/02-13:42:57",
            "id": "dntfm0y",
            "is_submitter": true,
            "link_id": "t3_73q1oq",
            "parent_id": "t1_dntf7qp",
            "score": 1,
            "stickied": false,
            "author_name": "dwThread"
        },
        "dntfgtg": {
            "comment": "There's an infosec community on twitch although I think I'm the only one that broadcasts malware research. I don't have a mic though so I'm sure it's pretty boring if anyone actually watches ",
            "timeStamp": "2017/10/02-13:40:21",
            "id": "dntfgtg",
            "is_submitter": false,
            "link_id": "t3_73q1oq",
            "parent_id": "t3_73q1oq",
            "score": 1,
            "stickied": false,
            "author_name": "sysopfb"
        },
        "dntf7qp": {
            "comment": "+1 for youtube or vimeo or what ever for us that are in different tinezones as well! This sounds good",
            "timeStamp": "2017/10/02-13:35:52",
            "id": "dntf7qp",
            "is_submitter": false,
            "link_id": "t3_73q1oq",
            "parent_id": "t1_dnt2axo",
            "score": 1,
            "stickied": false,
            "author_name": "Banangurkamacka"
        },
        "dnt42os": {
            "comment": "When do you think you would host this stream? ",
            "timeStamp": "2017/10/02-10:19:05",
            "id": "dnt42os",
            "is_submitter": false,
            "link_id": "t3_73q1oq",
            "parent_id": "t1_dnsdov4",
            "score": 1,
            "stickied": false,
            "author_name": "OkeepTooth"
        },
        "dnt2axo": {
            "comment": "A twitch stream as well as a YouTube upload would be a great help for those of us that don't use twitch. I'm interested",
            "timeStamp": "2017/10/02-09:48:01",
            "id": "dnt2axo",
            "is_submitter": false,
            "link_id": "t3_73q1oq",
            "parent_id": "t3_73q1oq",
            "score": 1,
            "stickied": false,
            "author_name": "paperboy-"
        },
        "dnt1y80": {
            "comment": "Beside /u/IamAPrinter 's response of string XOR-ing, phony op codes are kind of vague but I'm specifically describing two things. \n\nThe first is UnhandledExceptionFilters, you can implement this programmatically as essentially your \"last resort\" to catch exceptions. The problem with this is if you're under a debugging your \"last resort\" isn't genuinely a last resort because you're being debugged! So, you set an UnhandledExceptionFilter and on the assembler level you do an instruction which, under normal conditions, would be caught and flow control would resume as normal (such as 0 divided by 0). Under a debugging however this causes the application to terminate. This technique was first described by Peter Ferrie over at Microsoft in 2011.\n\nThe second one is the CPUID. Under normal circumstances you can MOV EAX, 1 (set the EAX register to 1) and call/invoke/whatever... CPUID (assembler instruction). \"The 31st bit of ECX on a physical machine will be equal to 0. On a guest VM it will equal to 1.\" ... \"by calling CPUID with EAX=40000000 as input,1 the malware will get, as the return value, the virtualization vendor string in EAX, ECX, EDX.\"\n\n\n(Please note the codeproject page stole directly from Peter Ferrie).\nYou can read about the first technique here: https://www.codeproject.com/Articles/30815/An-Anti-Reverse-Engineering-Guide#UnhandledExceptionFilter\n\nYou can read about the second technique here: https://www.cyberbit.com/endpoint-security/anti-vm-and-anti-sandbox-explained/\n\n\nPeter Ferrie's original paper can be found here: http://anti-reversing.com/Downloads/Anti-Reversing/The_Ultimate_Anti-Reversing_Reference.pdf\n\n",
            "timeStamp": "2017/10/02-09:41:49",
            "id": "dnt1y80",
            "is_submitter": true,
            "link_id": "t3_73q1oq",
            "parent_id": "t1_dnsjkz0",
            "score": 1,
            "stickied": false,
            "author_name": "dwThread"
        },
        "dnt0r61": {
            "comment": "Yup :)",
            "timeStamp": "2017/10/02-09:20:41",
            "id": "dnt0r61",
            "is_submitter": true,
            "link_id": "t3_73q1oq",
            "parent_id": "t1_dnt0903",
            "score": 1,
            "stickied": false,
            "author_name": "dwThread"
        },
        "dnt0903": {
            "comment": "Strings can either be extracted during runtime (I.e from  memory using process hacker for example) from or from static analysis (such as pestudio). When strings are XOR'ed, and (i assume xored back during runtime using the authors own functions) they appear as garbage strings, unreadable gibberish. Xoring is an operation done on a byte level where you take the nth bit of an input, do a logical \"exclusive or\" with it using the nth bit of some data the author holds and output the result. You can read about XOR on Wikipedia for example, but gist of it is that 1 with 0 is 1 and everything else is 0..(and of course 0 with 1 is 1) ",
            "timeStamp": "2017/10/02-09:11:51",
            "id": "dnt0903",
            "is_submitter": false,
            "link_id": "t3_73q1oq",
            "parent_id": "t1_dnsjkz0",
            "score": 2,
            "stickied": false,
            "author_name": "IamAPrinter"
        },
        "dnsyp19": {
            "comment": "Sounds really cool, I'd tune in.",
            "timeStamp": "2017/10/02-08:44:00",
            "id": "dnsyp19",
            "is_submitter": false,
            "link_id": "t3_73q1oq",
            "parent_id": "t3_73q1oq",
            "score": 1,
            "stickied": false,
            "author_name": "HereticalHermit"
        },
        "dnsyhm7": {
            "comment": "I'm interested, let me know when you share",
            "timeStamp": "2017/10/02-08:40:18",
            "id": "dnsyhm7",
            "is_submitter": false,
            "link_id": "t3_73q1oq",
            "parent_id": "t3_73q1oq",
            "score": 1,
            "stickied": false,
            "author_name": "maliciousidea"
        },
        "dnsw5fk": {
            "comment": "I would find this interesting and would watch.",
            "timeStamp": "2017/10/02-07:57:14",
            "id": "dnsw5fk",
            "is_submitter": false,
            "link_id": "t3_73q1oq",
            "parent_id": "t3_73q1oq",
            "score": 1,
            "stickied": false,
            "author_name": "zushiba"
        },
        "dnsq1xm": {
            "comment": "I know nothing of malware analysis but would love to listen and maybe learn a thing or two!\n\nAny chance you could start with the absolute basics? What is malware analysis, how you can spot it etc and then work your way up to your level kind of thing.",
            "timeStamp": "2017/10/02-05:42:58",
            "id": "dnsq1xm",
            "is_submitter": false,
            "link_id": "t3_73q1oq",
            "parent_id": "t3_73q1oq",
            "score": 1,
            "stickied": false,
            "author_name": "RudeCanadianDude"
        },
        "dnsnq2k": {
            "comment": "Id tune in as well. Sounds interesting",
            "timeStamp": "2017/10/02-04:31:20",
            "id": "dnsnq2k",
            "is_submitter": false,
            "link_id": "t3_73q1oq",
            "parent_id": "t1_dnsgksp",
            "score": 1,
            "stickied": false,
            "author_name": "Chicken_Panda"
        },
        "dnskx4o": {
            "comment": "I’d love too watch! Just discuss all the things you feel comfortable talking about. Looking forward to it!",
            "timeStamp": "2017/10/02-02:26:22",
            "id": "dnskx4o",
            "is_submitter": false,
            "link_id": "t3_73q1oq",
            "parent_id": "t3_73q1oq",
            "score": 2,
            "stickied": false,
            "author_name": "twrdosaurus"
        },
        "dnsjkz0": {
            "comment": "Beginner here:what do you mean by string xor and phony op codes.",
            "timeStamp": "2017/10/02-01:17:36",
            "id": "dnsjkz0",
            "is_submitter": false,
            "link_id": "t3_73q1oq",
            "parent_id": "t3_73q1oq",
            "score": 1,
            "stickied": false,
            "author_name": "insec99"
        },
        "dnsitgv": {
            "comment": "I am interested too. Please say when.",
            "timeStamp": "2017/10/02-00:41:46",
            "id": "dnsitgv",
            "is_submitter": false,
            "link_id": "t3_73q1oq",
            "parent_id": "t3_73q1oq",
            "score": 1,
            "stickied": false,
            "author_name": "HydraBroodmaster"
        },
        "dnsgksp": {
            "comment": "I'd tune in. My name backwards is...",
            "timeStamp": "2017/10/01-23:09:48",
            "id": "dnsgksp",
            "is_submitter": false,
            "link_id": "t3_73q1oq",
            "parent_id": "t1_dnsf3pu",
            "score": 2,
            "stickied": false,
            "author_name": "Tiktoor"
        },
        "dnsg2f6": {
            "comment": "Impressive, keep us up2date !",
            "timeStamp": "2017/10/01-22:50:20",
            "id": "dnsg2f6",
            "is_submitter": false,
            "link_id": "t3_73q1oq",
            "parent_id": "t3_73q1oq",
            "score": 1,
            "stickied": false,
            "author_name": "CipheredBytes"
        },
        "dnsg1j1": {
            "comment": "Do it and let us know",
            "timeStamp": "2017/10/01-22:49:24",
            "id": "dnsg1j1",
            "is_submitter": false,
            "link_id": "t3_73q1oq",
            "parent_id": "t3_73q1oq",
            "score": 1,
            "stickied": false,
            "author_name": "yallapapi"
        },
        "dnsf3pu": {
            "comment": "Well I don't know anywhere here or anyone who would be interested. Are you active here? If so do you think you could help me organize this?",
            "timeStamp": "2017/10/01-22:15:12",
            "id": "dnsf3pu",
            "is_submitter": true,
            "link_id": "t3_73q1oq",
            "parent_id": "t1_dnsdqmb",
            "score": 7,
            "stickied": false,
            "author_name": "dwThread"
        },
        "dnsdqmb": {
            "comment": "I don't really care, quite frankly all of this sounds interesting.",
            "timeStamp": "2017/10/01-21:30:44",
            "id": "dnsdqmb",
            "is_submitter": false,
            "link_id": "t3_73q1oq",
            "parent_id": "t1_dnsdov4",
            "score": 3,
            "stickied": false,
            "author_name": "Celebrinborn"
        },
        "dnsdov4": {
            "comment": "Yeah I'll do it then. What should I discuss?",
            "timeStamp": "2017/10/01-21:29:16",
            "id": "dnsdov4",
            "is_submitter": true,
            "link_id": "t3_73q1oq",
            "parent_id": "t1_dnsbxvx",
            "score": 5,
            "stickied": false,
            "author_name": "dwThread"
        },
        "dnsc5y4": {
            "comment": "Ohh this sounds really awesome ",
            "timeStamp": "2017/10/01-20:47:56",
            "id": "dnsc5y4",
            "is_submitter": false,
            "link_id": "t3_73q1oq",
            "parent_id": "t3_73q1oq",
            "score": 1,
            "stickied": false,
            "author_name": "Legendofmudkip"
        },
        "dnsbxvx": {
            "comment": "That sounds really interesting.\n\nIf you share please let me know",
            "timeStamp": "2017/10/01-20:42:16",
            "id": "dnsbxvx",
            "is_submitter": false,
            "link_id": "t3_73q1oq",
            "parent_id": "t3_73q1oq",
            "score": 8,
            "stickied": false,
            "author_name": "Celebrinborn"
        }
    }
}