{
    "op": {
        "upvote_ratio": null,
        "selftext": "Looking for a book/resource to have a better high level understanding of how Malware works.\n\nDid OSCP a couple of years ago and started with the exercises on the PMA book, but for where my career is going that is too hands-on.\n\nI would need a more general overview. Started reading the CISSP guide but that is TOO generic.\n\nIs there something inbetween?\n\n",
        "title": "Higher level analysis than Practical Malware Analysis?",
        "score": 7,
        "id": "8bua0w",
        "commsNum": 19,
        "timeStamp": "2018/04/12-15:27:14",
        "author_name": "dGonzo",
        "is_self": true,
        "locked": false,
        "num_comments": 19,
        "over_18": false,
        "spoiler": false,
        "subreddit": "malware",
        "stickied": false,
        "url": "https://www.reddit.com/r/Malware/comments/8bua0w/higher_level_analysis_than_practical_malware/"
    },
    "posts": {
        "dzrixkr": {
            "comment": "[removed]",
            "timeStamp": "2018/05/29-07:16:41",
            "id": "dzrixkr",
            "is_submitter": false,
            "link_id": "t3_8bua0w",
            "parent_id": "t3_8bua0w",
            "score": 1,
            "stickied": false,
            "author_name": "[deleted]"
        },
        "dyjzizk": {
            "comment": "Hey, ghostinshell000, just a quick heads-up:  \n**alot** is actually spelled **a lot**. You can remember it by **it is one lot, 'a lot'**.  \nHave a nice day!\n\n^^^^The ^^^^parent ^^^^commenter ^^^^can ^^^^reply ^^^^with ^^^^'delete' ^^^^to ^^^^delete ^^^^this ^^^^comment.",
            "timeStamp": "2018/05/06-14:35:13",
            "id": "dyjzizk",
            "is_submitter": false,
            "link_id": "t3_8bua0w",
            "parent_id": "t1_dyjzi7v",
            "score": 1,
            "stickied": false,
            "author_name": "CommonMisspellingBot"
        },
        "dyjzi7v": {
            "comment": "I never got any certs, didnt have time for them.  HR loves them tho.  I spend alot of time on the defense side, \n\nand I work thru books like PMA for context, and understanding of where the lay of the land is and where its going sorts of stuff. \n\nalso explore stuff like nirsoft toolchain, amazing tools.   ",
            "timeStamp": "2018/05/06-14:34:50",
            "id": "dyjzi7v",
            "is_submitter": false,
            "link_id": "t3_8bua0w",
            "parent_id": "t1_dyf2s4u",
            "score": 1,
            "stickied": false,
            "author_name": "ghostinshell000"
        },
        "dyf2s4u": {
            "comment": "Graph theory! Study acyclic and cyclic graphs! Use Graph modes! THey are very helpful to finding the infromation you need regarding x86 numbers and whatnot, decoding the instructions and inferring the secrets of the malware.\n\nI advise you not to get a CISSP. Those are not the turtles you want if you wish to explore. If you enslave yourself to the paycheck, you will lose your passion. Symantec steals it, for example, sapping it from you like some sort of wicked resource that ultimately fuels their profits. Avoid VirusTotal as well. And frankly try and avoid the malware industry in general. You want fun? You gotta find the sources yourself. Set up a HONEYPOT. Set up a MALWARE REPOSITORY, namely in the form of documents and analysis that are easily consumable. Please do not copy my writing for this\\-\\- clear and concise logic is key here, allowing the scientist to properly consume the content.\n\nSeriously, don't get a CISSP. Don't end up like me.",
            "timeStamp": "2018/05/03-19:28:01",
            "id": "dyf2s4u",
            "is_submitter": false,
            "link_id": "t3_8bua0w",
            "parent_id": "t3_8bua0w",
            "score": 2,
            "stickied": false,
            "author_name": "viinamari"
        },
        "dxnhvfq": {
            "comment": "Acquire malware samples and reverse them.\n\nRead write-ups from individual researcher and security vendor blogs.",
            "timeStamp": "2018/04/19-15:58:34",
            "id": "dxnhvfq",
            "is_submitter": false,
            "link_id": "t3_8bua0w",
            "parent_id": "t3_8bua0w",
            "score": 1,
            "stickied": false,
            "author_name": "688as"
        },
        "dxlfr17": {
            "comment": "I have it for a reverse engineering course I am taking currently.  The book is very good and the material is not dated.  The foundations of how to look and work through malware don't change much.  Tools get better, but complied code is code complied to run on long standing standard systems.",
            "timeStamp": "2018/04/18-15:55:38",
            "id": "dxlfr17",
            "is_submitter": false,
            "link_id": "t3_8bua0w",
            "parent_id": "t1_dxi0mxn",
            "score": 3,
            "stickied": false,
            "author_name": "reduhl"
        },
        "dxi0mxn": {
            "comment": "While people are discussing PMA, is this the recommended reading for understanding Malware analysis despite being published in 2011? I want to go deep and do not plan to \"consult\".",
            "timeStamp": "2018/04/17-01:18:33",
            "id": "dxi0mxn",
            "is_submitter": false,
            "link_id": "t3_8bua0w",
            "parent_id": "t3_8bua0w",
            "score": 1,
            "stickied": false,
            "author_name": "Fluxay23"
        },
        "dxdn84b": {
            "comment": "I definitely agree with your assessment of OP. However, I don't agree with the general statement that \"those who can't do...consult.\" If that wasn't intended as a general statement, my bad.\n\nFrom my experience in IR, the consultants (along with a handful of people at mostly large companies) are often the ones at the cutting edge of forensics.\n\nI think the issue is that the traditional role of a consultant was to just give advice, but now there are lots of fields that use it as a generic term for someone that gets hired to do a thing for someone else that doesn't know how.",
            "timeStamp": "2018/04/14-17:28:45",
            "id": "dxdn84b",
            "is_submitter": false,
            "link_id": "t3_8bua0w",
            "parent_id": "t1_dxdmtgt",
            "score": 1,
            "stickied": false,
            "author_name": "phaus"
        },
        "dxdmtgt": {
            "comment": "This guy is asking for quick knowledge so he can go consult in this area as an expert.  That's what this thread is about.  Some consultants may consult in areas where they truly are experts.  OP has chosen to consult in an area where they are not experienced and has stated that learning the trade would be a waste of their time.",
            "timeStamp": "2018/04/14-17:21:03",
            "id": "dxdmtgt",
            "is_submitter": false,
            "link_id": "t3_8bua0w",
            "parent_id": "t1_dxdmiq0",
            "score": 2,
            "stickied": false,
            "author_name": "TParis00ap"
        },
        "dxdmiq0": {
            "comment": "Consultant is such a vague job title its difficult to form an accurate assessment of without knowing the nature of their work or the company that they work for. There are plenty of IR consultants that are very good at what they do. Sure, they don't usually stick around, but in most cases they are hired because the client either doesn't have a proper IR program, or they have a team that lacks the experience of dealing with a serious threat.",
            "timeStamp": "2018/04/14-17:15:20",
            "id": "dxdmiq0",
            "is_submitter": false,
            "link_id": "t3_8bua0w",
            "parent_id": "t1_dxbok72",
            "score": 1,
            "stickied": false,
            "author_name": "phaus"
        },
        "dxbok72": {
            "comment": "Yea, you're definitely the person we're talking about.  A consultant is even worse.  You don't have to stick around and suffer the consequences of your terrible decision.  Those that can't do...consult.\n\nThere is a reason agile teams take away most of the power from managers...",
            "timeStamp": "2018/04/13-15:08:07",
            "id": "dxbok72",
            "is_submitter": false,
            "link_id": "t3_8bua0w",
            "parent_id": "t1_dxbj9z5",
            "score": 2,
            "stickied": false,
            "author_name": "TParis00ap"
        },
        "dxbj9z5": {
            "comment": "What a crappy place you might have worked in where someone with no hands on experience on what the team is doing is allowed to lead it.\n\nI've been in that team and would not enjoy leading it.\n\nI have a consultant role that requires me understanding multiple products from the industry and advising which might be better depending on the needs. Trying to become technically better at it filtering through the BS that marketing teams have meticulously curated.\n\nBeen quite technical in the past and seen that \"everyone not doing our job is a greedy salesperson/manager\" toxic attitude that fills the technical teams. And trust me, managers love to keep techies thinking like that. \n",
            "timeStamp": "2018/04/13-13:40:00",
            "id": "dxbj9z5",
            "is_submitter": true,
            "link_id": "t3_8bua0w",
            "parent_id": "t1_dxawzz6",
            "score": 1,
            "stickied": false,
            "author_name": "dGonzo"
        },
        "dxbbwli": {
            "comment": "Maybe look into automated analysis, something like Cuckoo Sandbox or sites like hybrid analysis. ",
            "timeStamp": "2018/04/13-11:46:12",
            "id": "dxbbwli",
            "is_submitter": false,
            "link_id": "t3_8bua0w",
            "parent_id": "t3_8bua0w",
            "score": 2,
            "stickied": false,
            "author_name": "sleepingjobman"
        },
        "dxayvo8": {
            "comment": "We all do, man.  My comment is driven by my fear of the level of competence of my boss too.  Luckily, I work for a real smart guy right now.  But he leaves in a few months.",
            "timeStamp": "2018/04/13-08:35:09",
            "id": "dxayvo8",
            "is_submitter": false,
            "link_id": "t3_8bua0w",
            "parent_id": "t1_dxay9yu",
            "score": 1,
            "stickied": false,
            "author_name": "TParis00ap"
        },
        "dxay9yu": {
            "comment": "As someone in that position, I worry this is the case...",
            "timeStamp": "2018/04/13-08:26:24",
            "id": "dxay9yu",
            "is_submitter": false,
            "link_id": "t3_8bua0w",
            "parent_id": "t1_dxawzz6",
            "score": 3,
            "stickied": false,
            "author_name": "specter800"
        },
        "dxawzz6": {
            "comment": "&gt;What are you trying to achieve?\n\nEnough knowledge to pass an interview for a management position over a malware analysis team so they can make $$$ pretending to know what they're talking about while their underpaid subordinates hate them.",
            "timeStamp": "2018/04/13-08:07:56",
            "id": "dxawzz6",
            "is_submitter": false,
            "link_id": "t3_8bua0w",
            "parent_id": "t1_dxaonjq",
            "score": 1,
            "stickied": false,
            "author_name": "TParis00ap"
        },
        "dxawusu": {
            "comment": "You might look to policy based security, admin, and CSO articles to bridge the gap.  CISSP guide is a great overall look but does not focus on cyber.  PMA is great for people close to the hardware.    ",
            "timeStamp": "2018/04/13-08:05:46",
            "id": "dxawusu",
            "is_submitter": false,
            "link_id": "t3_8bua0w",
            "parent_id": "t3_8bua0w",
            "score": 1,
            "stickied": false,
            "author_name": "reduhl"
        },
        "dxaonjq": {
            "comment": "&gt; ...but for what I am trying to achieve it would not be the best use of my time.\n\nWhat are you trying to achieve?",
            "timeStamp": "2018/04/13-05:48:29",
            "id": "dxaonjq",
            "is_submitter": false,
            "link_id": "t3_8bua0w",
            "parent_id": "t1_dxa3l9g",
            "score": 1,
            "stickied": false,
            "author_name": "specter800"
        },
        "dxa5k7o": {
            "comment": "I don't know that there's really any specific training for what you seem to be referring to.  Basically, if you understand the nitty gritty of how a piece of software works, you can probably dumb it down pretty easily.  Instead of saying \"it enters a FOR loop until condition A is met\" just say \"it looks for condition A, and exits if it isn't found\".  Make sense?",
            "timeStamp": "2018/04/12-20:27:56",
            "id": "dxa5k7o",
            "is_submitter": false,
            "link_id": "t3_8bua0w",
            "parent_id": "t3_8bua0w",
            "score": 2,
            "stickied": false,
            "author_name": "SpotOnTheRug"
        },
        "dxa3l9g": {
            "comment": "I completely understand where you're going with that last sentence. \n\nHowever malware conversations happen outside specialized malware analysis teams. As you pointed the first 3 chapters are good for an overview and what I am looking is for something that continues in that style.\n\nI have played with IDApro and Ollydbg and I could spend countless hours in there, but for what I am trying to achieve it would not be the best use of my time.",
            "timeStamp": "2018/04/12-19:49:42",
            "id": "dxa3l9g",
            "is_submitter": true,
            "link_id": "t3_8bua0w",
            "parent_id": "t1_dx9t32i",
            "score": 1,
            "stickied": false,
            "author_name": "dGonzo"
        },
        "dx9zt8g": {
            "comment": "[deleted]",
            "timeStamp": "2018/04/12-18:42:52",
            "id": "dx9zt8g",
            "is_submitter": false,
            "link_id": "t3_8bua0w",
            "parent_id": "t3_8bua0w",
            "score": 8,
            "stickied": false,
            "author_name": "[deleted]"
        },
        "dx9t32i": {
            "comment": "Chapters 0-3 of the PMA book are really good for an overview. Everything from then on gets more hands on low level.\n\nNot sure how you expect to understand how malware works while remaining hands off and high level....",
            "timeStamp": "2018/04/12-16:49:22",
            "id": "dx9t32i",
            "is_submitter": false,
            "link_id": "t3_8bua0w",
            "parent_id": "t3_8bua0w",
            "score": 5,
            "stickied": false,
            "author_name": "thopot"
        }
    }
}