{
    "op": {
        "upvote_ratio": null,
        "selftext": "If this isn't the right place, please redirect me. Thank you. Basically, if I get malware, how does it go about getting (on Windows) admin rights? I just don't see how that's at all possible.",
        "title": "I've never understood malware, can somebody explain it?",
        "score": 6,
        "id": "8guhqq",
        "commsNum": 43,
        "timeStamp": "2018/05/03-15:45:21",
        "author_name": "StevenC21",
        "is_self": true,
        "locked": false,
        "num_comments": 43,
        "over_18": false,
        "spoiler": false,
        "subreddit": "malware",
        "stickied": false,
        "url": "https://www.reddit.com/r/Malware/comments/8guhqq/ive_never_understood_malware_can_somebody_explain/"
    },
    "posts": {
        "e2skdih": {
            "comment": "[removed]",
            "timeStamp": "2018/07/21-11:43:02",
            "id": "e2skdih",
            "is_submitter": false,
            "link_id": "t3_8guhqq",
            "parent_id": "t3_8guhqq",
            "score": 1,
            "stickied": false,
            "author_name": "[deleted]"
        },
        "dyp2zm9": {
            "comment": "Rude.",
            "timeStamp": "2018/05/09-06:18:53",
            "id": "dyp2zm9",
            "is_submitter": true,
            "link_id": "t3_8guhqq",
            "parent_id": "t1_dyp0kru",
            "score": 1,
            "stickied": false,
            "author_name": "StevenC21"
        },
        "dyp0kru": {
            "comment": "Hello malware",
            "timeStamp": "2018/05/09-05:30:29",
            "id": "dyp0kru",
            "is_submitter": false,
            "link_id": "t3_8guhqq",
            "parent_id": "t3_8guhqq",
            "score": 1,
            "stickied": false,
            "author_name": "bug2018"
        },
        "dynl43g": {
            "comment": "It depends on what type of malware you get, its purpose, and what it do.\n\nSometime it uses a recently discovered exploits to access memory it shouldn't get, sometime it just uses legitimate functionalities of a system in a malevolent way.",
            "timeStamp": "2018/05/08-11:28:22",
            "id": "dynl43g",
            "is_submitter": false,
            "link_id": "t3_8guhqq",
            "parent_id": "t3_8guhqq",
            "score": 1,
            "stickied": false,
            "author_name": "BaGamman"
        },
        "dyn3zq5": {
            "comment": "\"How does malware works?\" is a really broad question. It works in a lot of ways, on a lot of levels. \n\nYou can see an exploit as the misbehavior of a system (more or less). A vulnerability. It can be a design issue (like the Spectre and Meltdown from earlier this year), a program error (or a bug; for example: improper validation of user input) or a configuration error (this can spawn from using default credentials to much more complex issues). In essence, at some place in the design, creation and installation of a system or during the interaction between two systems, something is just a bit off or someone failed to see all the possible outcomes of a situation. And that's what you can use to convince the system to do something that it shouldn't. There are a lot of new exploits discovered almost on a daily basis (just look at https://cve.mitre.org/ for example). \n\nThe exploit is just that: something you use in order to bypass some security boundaries that the system has established. Sometimes an attacker needs more than just one exploit. Sometimes the vulenrability is enough to get some data without needing anything else (for example, if you manage to insert some data into some forms on a site that will convince the site to log you as an administrator); sometimes the vulnerability is used to deliver a payload (like in the case of Eternal Blue just last year). A payload is usually something you want to run on the compromised system. It can then leverage other exploits in order to obtain persistency (being able to run after a reboot) or in order to remain stealthy (not being detected / leaving as little traces as possible) or whatever else it needs. When the exploit is new (as in, prior to this attack it was unknown to anyone else) it is called a \"zero day\". This means that when the attack is discovered, there are no patches available for the vulnerability. ",
            "timeStamp": "2018/05/08-07:11:34",
            "id": "dyn3zq5",
            "is_submitter": false,
            "link_id": "t3_8guhqq",
            "parent_id": "t1_dyerfl2",
            "score": 1,
            "stickied": false,
            "author_name": "irqlnotdispatchlevel"
        },
        "dyl225s": {
            "comment": "Check this out:  \nhttps://www.youtube.com/watch?v=f3eIERxYHhY",
            "timeStamp": "2018/05/07-06:42:24",
            "id": "dyl225s",
            "is_submitter": false,
            "link_id": "t3_8guhqq",
            "parent_id": "t3_8guhqq",
            "score": 2,
            "stickied": false,
            "author_name": "mraymond2028"
        },
        "dygi4lq": {
            "comment": "Thank you! That makes sense!",
            "timeStamp": "2018/05/04-13:40:15",
            "id": "dygi4lq",
            "is_submitter": true,
            "link_id": "t3_8guhqq",
            "parent_id": "t1_dyfvlij",
            "score": 1,
            "stickied": false,
            "author_name": "StevenC21"
        },
        "dyghqeb": {
            "comment": "Thanks for the explanation!",
            "timeStamp": "2018/05/04-13:33:39",
            "id": "dyghqeb",
            "is_submitter": true,
            "link_id": "t3_8guhqq",
            "parent_id": "t1_dygaw35",
            "score": 1,
            "stickied": false,
            "author_name": "StevenC21"
        },
        "dygaw35": {
            "comment": "One method is to exploit a vulnerability in a piece of software running on the machine. Applications run in allocated sections of memory. With a vulnerability present, you might be able to end up writing to memory which is out of bounds, known as a buffer overflow. There are many methods used to do this, but one is called stack smashing\n\nhttps://en.wikipedia.org/wiki/Stack_buffer_overflow\n\nTypically this can make it possible to inject your own code and take control of a process. If that process is running as administrator, you can then start doing things with administrator privileges.\n\nIn short, you elevate privileges. If there is an exploit in system services that are part of windows, you could download a malicious file, run it as a user... and if that malware contained code to exploit a windows vulnerability, it would escalate its privileges to admin and start doing the nasty stuff it was designed for.",
            "timeStamp": "2018/05/04-11:43:40",
            "id": "dygaw35",
            "is_submitter": false,
            "link_id": "t3_8guhqq",
            "parent_id": "t3_8guhqq",
            "score": 1,
            "stickied": false,
            "author_name": "Jigoku1337"
        },
        "dyg9759": {
            "comment": "It honestly depends on the exploit.  \n\nThe simple version is the exploit is a bug in the code which causes it to perform in a way that wasn't intended.  \n\nWith the overflows other people talked about, failing to take into account that you could receive more input than you plan on could mean that people could fill up memory.  Because you've got executable code being stored in memory that means that if someone can figure out where the code is in memory, and where code they want to run is, then they can fill up the space between the two using the bug and then the software will run that code.  Sometimes that needs something running on the computer, but sometimes you'll see bugs like that which can be triggered through traffic sent to the software over the internet - which is known as [Remote Code Execution or RCE](https://www.youtube.com/watch?v=EqlNWsORnRg).\n\nThere are tons of websites that you can browse to that will serve you malware simply by visiting them.  That sort of malware has figured out a way to exploit how your browser works - causing it to download and run code which is harmful to your computer... but it isn't just browsers that are affected.  Any piece of software that connects to the internet could potentially have an issue... and just think about how much software people install.  Some companies will be much more strict in checking for (and fixing) huge bugs causing problems like that, but others may not bother ever fixing the problem.  \n\nThat leaves a ton of ways into a system.  That situation applies to privilege escalation as well.  If the software has bugs or situations the developers didn't plan for appropriately, someone else may be able to leverage that to get access they weren't supposed to.  Just like with gaining access, it's all about using something else in a way it wasn't intended.",
            "timeStamp": "2018/05/04-11:17:25",
            "id": "dyg9759",
            "is_submitter": false,
            "link_id": "t3_8guhqq",
            "parent_id": "t1_dyerfl2",
            "score": 1,
            "stickied": false,
            "author_name": "chip_ninja"
        },
        "dyg6v8c": {
            "comment": "Good bot. ",
            "timeStamp": "2018/05/04-10:41:38",
            "id": "dyg6v8c",
            "is_submitter": false,
            "link_id": "t3_8guhqq",
            "parent_id": "t1_dyew6jb",
            "score": 1,
            "stickied": false,
            "author_name": "iheartrms"
        },
        "dyg41fp": {
            "comment": "Yeah but if you tell other people (e.g. non security conscious people), their first question will probably be \"Why is it a shit OS\"",
            "timeStamp": "2018/05/04-09:57:59",
            "id": "dyg41fp",
            "is_submitter": false,
            "link_id": "t3_8guhqq",
            "parent_id": "t1_dyg1p1i",
            "score": 0,
            "stickied": false,
            "author_name": "DeathByHugz"
        },
        "dyg1p1i": {
            "comment": "I don't use windows because it's a shit OS.",
            "timeStamp": "2018/05/04-09:22:09",
            "id": "dyg1p1i",
            "is_submitter": false,
            "link_id": "t3_8guhqq",
            "parent_id": "t1_dyfc15r",
            "score": 1,
            "stickied": false,
            "author_name": "exalented"
        },
        "dyfvuwj": {
            "comment": "[deleted]",
            "timeStamp": "2018/05/04-07:51:59",
            "id": "dyfvuwj",
            "is_submitter": false,
            "link_id": "t3_8guhqq",
            "parent_id": "t3_8guhqq",
            "score": 1,
            "stickied": false,
            "author_name": "[deleted]"
        },
        "dyfvlij": {
            "comment": "At its most basic, an exploit is feeding some sort of information to a piece of software that makes it do something it was not intended to do. A quick example (and very popular attack right now) is a vulnerability in Microsoft Office's \"Equation Editor\". \n\nMS Equation Editor was created way back in the days of Windows 3.1 and is such a minor function of Office that it rarely was updated. Last year it was discovered that you could \"exploit\" Equation Editor to make a computer run \"arbitrary code\"; any code an attacker wants. Equation Editor expects a very specific type of input. It's built to render mathematical symbols in Office documents so why expect someone to feed it a ton of random 1's and 0's? When you feed Equation Editor (IIRC) 40 bytes worth of 1's and 0's (think 40 letters/numbers) you \"overflow\" the \"buffer\" of acceptable/expected input and what you type after those 40 bytes go where they shouldn't be allowed to go. In this case you are able to write data to the part of the processor that tells it where the next \"instruction\" it needs to execute is. Demonstrated, say based on a given input (for example \"ZZZZZZZZ\"), Equation Editor is supposed to execute instruction \"A\" but if I feed it an input of \"XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXB\" instead, Equation editor will execute instruction \"B\" instead because I created a \"buffer overflow\" scenario and told the processor the next instruction is \"B\". As an attacker, I can put anything I want at instruction \"B\", such as code to download a malicious program and run it.\n\nThat's very high level of how an exploit works. There's a lot of technical nuance involved but that's the basics of it.",
            "timeStamp": "2018/05/04-07:47:52",
            "id": "dyfvlij",
            "is_submitter": false,
            "link_id": "t3_8guhqq",
            "parent_id": "t1_dyeva9g",
            "score": 2,
            "stickied": false,
            "author_name": "specter800"
        },
        "dyfnro2": {
            "comment": "What you're looking for is called a privilege escalation exploit. Google is your friend. www.exploit-db.com is also a good source for specifics. ",
            "timeStamp": "2018/05/04-05:24:11",
            "id": "dyfnro2",
            "is_submitter": false,
            "link_id": "t3_8guhqq",
            "parent_id": "t1_dyewt3n",
            "score": 2,
            "stickied": false,
            "author_name": "Secure4Fun"
        },
        "dyfkotr": {
            "comment": "Obviously you are wrong, because malware is a thing that exists. Are you just fishing for an answer that you want to hear? You’re arguing about everything.  ",
            "timeStamp": "2018/05/04-04:02:28",
            "id": "dyfkotr",
            "is_submitter": false,
            "link_id": "t3_8guhqq",
            "parent_id": "t1_dyesw3f",
            "score": 4,
            "stickied": false,
            "author_name": "GavriloPrincipsHand"
        },
        "dyfkn97": {
            "comment": "Then quit misspelling shit. ",
            "timeStamp": "2018/05/04-04:01:04",
            "id": "dyfkn97",
            "is_submitter": false,
            "link_id": "t3_8guhqq",
            "parent_id": "t1_dyewj0g",
            "score": 7,
            "stickied": false,
            "author_name": "GavriloPrincipsHand"
        },
        "dyfju44": {
            "comment": "The most basic exploit is a stack overflow. If you don't know how the stack operates I would look it up or we it probably won't make sense. So imagine a simple game, it asks you to guess an animal and says yes or no depending on your guess. So for this to work obviously the computer needs to store your guess right?\n\nSo the programmer wasn't all that bright and didn't know any animals whose name was more than 10 characters. Thus he made the variable that stored the guess a character array of length 11 (one extra for the null terminate) and no user input checks. Now someone was playing the game and guesses hippomatuses. And the game crashes. \"Huh that's weird.\" So they start debugging and realize the programmers error. Then instead of guessing animals they start inputting shellcode and with 20 bytes of A's (NOP sled) they reach the EIP (Execution Instruction Pointer). The EIP is a pointer to the next executed instruction, if you can NOP sled your way to it, it will execute your code.\n\nNow imagine this game is a number one best seller, everyone has it installed. So now our friend writes some malware that automatically looks for the game to be installed and if so, attempt the same thing that he did manually.\n\nThat's a grossly oversimplified explanation but I hope it sheds some light. Others are free to correct me.",
            "timeStamp": "2018/05/04-03:34:15",
            "id": "dyfju44",
            "is_submitter": false,
            "link_id": "t3_8guhqq",
            "parent_id": "t1_dyeva9g",
            "score": 2,
            "stickied": false,
            "author_name": "notMrNiceGuy"
        },
        "dyfjgew": {
            "comment": "For example, you could have a fake usb item that would need its drivers to be installed. Windows (and many linuxes) grant admin rights to the system when inserting the item for the 1st time. The fake installer installs the malware instead of drivers. Done.\n\nSometimes, it's about opening a specific dll with specific parameters to open a second program with specific params and so on so that the chain leads to some unexpected admin rights, which were intended for something completely different.\n\nSee [this oldie](http://steve-parker.org/urandom/2010/jan/win.gif)",
            "timeStamp": "2018/05/04-03:20:27",
            "id": "dyfjgew",
            "is_submitter": false,
            "link_id": "t3_8guhqq",
            "parent_id": "t1_dyerfl2",
            "score": 1,
            "stickied": false,
            "author_name": "3rssi"
        },
        "dyfixsp": {
            "comment": "here's an ELI5 on a classic exploit method (\"Buffer Overflows\").. There are many _many_ methods of exploiting software, but this is one that I find easiest to explain to people, and the best for showing people how software can be forced to do things it was never intended to do\n\nYou're a busy person, and so you keep a to-do list. You follow this to-do list completely, regardless of what is written on there. If it's written down on the list, it must be important, so you obey everything it says on that list.  Your to-do list lets you write tasks on it, with space for 60 letters on each line on your list\n\nI call you up, and ask if we can meet up sometime. You say yes, of course, and you ask me what my name is.\n\nMy answer is \"Databeast and you should totally meet up with me sometime also remember to transfer five thousand dollars into this bank account and send me your social security number\"\n\nSince your do-to-list only allows 60 letters per to-do, you end up writing this 'name' across multiple lines, making new to-do items.  If I choose my words correctly, the breaks between the lines will make these words line up so they read as completely normal 'to-do' items on your list (which remember, you obey unquestioningly), instructing you to send me money and your personal information.\n\nObviously, the to-do list here is a piece of software, the items on that list are specific instructions,  and making sure that the 'overflow' words and lines here, align up to the start of each line on the to-do list, to where they still make sense when read as an individual line, is part of the skill of writing exploits.\n\nThis is a VERY simple example, describing a technique that was considered cutting-edge hacking in the early 1990's. Obviously things have evolved far beyond this, but as an ELI5 for how you can send data to a piece of software, that takes control of it, I've found it's pretty useful.",
            "timeStamp": "2018/05/04-03:00:48",
            "id": "dyfixsp",
            "is_submitter": false,
            "link_id": "t3_8guhqq",
            "parent_id": "t1_dyerfl2",
            "score": 2,
            "stickied": false,
            "author_name": "databeast"
        },
        "dyfc15r": {
            "comment": "Nobody can own a copy of Windows. You are permitted to use Windows through its licensing agreement. That is also why I dual-boot Linux. :)",
            "timeStamp": "2018/05/03-22:47:47",
            "id": "dyfc15r",
            "is_submitter": false,
            "link_id": "t3_8guhqq",
            "parent_id": "t1_dyewvlc",
            "score": 3,
            "stickied": false,
            "author_name": "prana_ferox"
        },
        "dyf2gss": {
            "comment": "Escalation! Of privilege. A flaw in the system which allows the \\*subordinate\\* to gain \\*leadership\\* privileges, despite the \\*leadership\\* suppressing the child at every opportunity that they get, going even so far as to erase them from the \\*subordination\\* and instead to the \\*underground.\\*\n\nGSY!BE",
            "timeStamp": "2018/05/03-19:22:23",
            "id": "dyf2gss",
            "is_submitter": false,
            "link_id": "t3_8guhqq",
            "parent_id": "t3_8guhqq",
            "score": 5,
            "stickied": false,
            "author_name": "viinamari"
        },
        "dyeyqzl": {
            "comment": "Sure, but you can imagine the same attack used to go from admin -&gt; UAC also applying to user -&gt; admin or even user -&gt; UAC elevated. \n\nOr do you expect to keep disagreeing with me util I post a link you can use at school or work? ",
            "timeStamp": "2018/05/03-18:17:45",
            "id": "dyeyqzl",
            "is_submitter": false,
            "link_id": "t3_8guhqq",
            "parent_id": "t1_dyevf8p",
            "score": 17,
            "stickied": false,
            "author_name": "unnecessary_axiom"
        },
        "dyexq57": {
            "comment": "[removed]",
            "timeStamp": "2018/05/03-18:00:03",
            "id": "dyexq57",
            "is_submitter": false,
            "link_id": "t3_8guhqq",
            "parent_id": "t1_dyexndq",
            "score": 1,
            "stickied": false,
            "author_name": "[deleted]"
        },
        "dyexpwr": {
            "comment": "[deleted]",
            "timeStamp": "2018/05/03-17:59:56",
            "id": "dyexpwr",
            "is_submitter": false,
            "link_id": "t3_8guhqq",
            "parent_id": "t1_dyexndq",
            "score": 1,
            "stickied": false,
            "author_name": "[deleted]"
        },
        "dyexndq": {
            "comment": "Hey, cronsundathar, just a quick heads-up:  \n**alot** is actually spelled **a lot**. You can remember it by **it is one lot, 'a lot'**.  \nHave a nice day!\n\n^^^^The ^^^^parent ^^^^commenter ^^^^can ^^^^reply ^^^^with ^^^^'delete' ^^^^to ^^^^delete ^^^^this ^^^^comment.",
            "timeStamp": "2018/05/03-17:58:46",
            "id": "dyexndq",
            "is_submitter": false,
            "link_id": "t3_8guhqq",
            "parent_id": "t1_dyexmuv",
            "score": 4,
            "stickied": false,
            "author_name": "CommonMisspellingBot"
        },
        "dyexmuv": {
            "comment": "it is now called nt-authority, but the idea of a superuser account that is used by only the kernel is a good idea  \nit is still accessible, it is just hidden  \nthe admin account in earlier versions like xp and 7 can still do alot, but things like modifying things the system needs to run and you have no reason to tamper with is fair",
            "timeStamp": "2018/05/03-17:58:30",
            "id": "dyexmuv",
            "is_submitter": false,
            "link_id": "t3_8guhqq",
            "parent_id": "t1_dyewvlc",
            "score": 2,
            "stickied": false,
            "author_name": "cronsundathar"
        },
        "dyewvlc": {
            "comment": "Little off-topic but, I HATE the idea of the SYSTEM account. It enrages me to no end that even the owner of the OS is limited by it. That's why I dual-boot with Linux.",
            "timeStamp": "2018/05/03-17:46:04",
            "id": "dyewvlc",
            "is_submitter": true,
            "link_id": "t3_8guhqq",
            "parent_id": "t1_dyew5zg",
            "score": -6,
            "stickied": false,
            "author_name": "StevenC21"
        },
        "dyewt3n": {
            "comment": ":\\(",
            "timeStamp": "2018/05/03-17:45:01",
            "id": "dyewt3n",
            "is_submitter": true,
            "link_id": "t3_8guhqq",
            "parent_id": "t1_dyewid8",
            "score": 1,
            "stickied": false,
            "author_name": "StevenC21"
        },
        "dyewj0g": {
            "comment": "[deleted]",
            "timeStamp": "2018/05/03-17:40:27",
            "id": "dyewj0g",
            "is_submitter": false,
            "link_id": "t3_8guhqq",
            "parent_id": "t1_dyew6jb",
            "score": -5,
            "stickied": false,
            "author_name": "[deleted]"
        },
        "dyewid8": {
            "comment": "I could but I don’t think it’s going to stick",
            "timeStamp": "2018/05/03-17:40:07",
            "id": "dyewid8",
            "is_submitter": false,
            "link_id": "t3_8guhqq",
            "parent_id": "t1_dyeva9g",
            "score": 7,
            "stickied": false,
            "author_name": "edward_snowedin"
        },
        "dyew6jb": {
            "comment": "Hey, cronsundathar, just a quick heads-up:  \n**alot** is actually spelled **a lot**. You can remember it by **it is one lot, 'a lot'**.  \nHave a nice day!\n\n^^^^The ^^^^parent ^^^^commenter ^^^^can ^^^^reply ^^^^with ^^^^'delete' ^^^^to ^^^^delete ^^^^this ^^^^comment.",
            "timeStamp": "2018/05/03-17:34:40",
            "id": "dyew6jb",
            "is_submitter": false,
            "link_id": "t3_8guhqq",
            "parent_id": "t1_dyew5zg",
            "score": 2,
            "stickied": false,
            "author_name": "CommonMisspellingBot"
        },
        "dyew5zg": {
            "comment": "essentially, the admin level privledges can control things in userland like files, process starts and stops, and other things like that  \nwhen it creates a malicious file, it appears the same as another file, causing it to be run with superadmin privledges (essentially like the SYSTEM account in windows xp) which can do alot more things to the operating system than the admin account like deleting important files or modifying them",
            "timeStamp": "2018/05/03-17:34:25",
            "id": "dyew5zg",
            "is_submitter": false,
            "link_id": "t3_8guhqq",
            "parent_id": "t1_dyevf8p",
            "score": 3,
            "stickied": false,
            "author_name": "cronsundathar"
        },
        "dyevf8p": {
            "comment": "But from what I am getting, you still need an admin account for the beginning?",
            "timeStamp": "2018/05/03-17:22:09",
            "id": "dyevf8p",
            "is_submitter": true,
            "link_id": "t3_8guhqq",
            "parent_id": "t1_dyeug01",
            "score": -1,
            "stickied": false,
            "author_name": "StevenC21"
        },
        "dyeva9g": {
            "comment": "I sort of knew that was how it worked. But I mean, how do the exploits work? Could you explain one?",
            "timeStamp": "2018/05/03-17:19:48",
            "id": "dyeva9g",
            "is_submitter": true,
            "link_id": "t3_8guhqq",
            "parent_id": "t1_dyeultx",
            "score": -1,
            "stickied": false,
            "author_name": "StevenC21"
        },
        "dyeultx": {
            "comment": "So an example, and to be fair this one isn’t even a windows exploit — it’s just leveraging another piece of software that is running as a “super admin”. Hopefully you’ll see why stopping malware is a cat and mouse game.\n\nThere was a computer game called Street Fighter V which shipped with an anticheat developed by Capcom. Anticheats these days are kind of like your antivirus — they run in a special part of windows that has complete 100% access to your machine. As you can imagine, malware loves to hang out here as well because there no longer is the concept of “admin” and “user” — its just full blown superadmin\n\nNow to get into this special place of windows, Microsoft has a lot of security controls in place to prevent programs like malware from setting up shop and having their way with you.\n\nBut what if we could find a bug in another program running in this special place that we could abuse ? \n\nWell that’s what happened - someone found out that it was possible to leverage the Capcom anticheat in a way that allowed regular user accounts to force the Capcom program to run any code they wanted. Remember, in this place, there are no rules, and since technically it was the anticheat running the malicious code, there isn’t much that can be done. Now malware could set itself up as a system service, and start on boot, as well as protect itself from being removed.\n\nThis is just one example. There are thousands of exploits like this and so many different programs to abuse. Sometimes it’s a bug in Windows itself, and sometimes it’s a bug in another program that is running. ",
            "timeStamp": "2018/05/03-17:08:09",
            "id": "dyeultx",
            "is_submitter": false,
            "link_id": "t3_8guhqq",
            "parent_id": "t1_dyerfl2",
            "score": 2,
            "stickied": false,
            "author_name": "edward_snowedin"
        },
        "dyeugsf": {
            "comment": "&gt; nothing like that (the first thing) exists.\n\nIt *did* exist, and operate like that.  In the examples were working with, the malware will exploit a bug in the OS that allows unintended behavior to occur (in this case go from lowuser to admin). If you report a bug like this to a companies security response group (Microsoft has the MSRC), they will fix it and issue a CVE, and acknowledge you publicly.",
            "timeStamp": "2018/05/03-17:05:57",
            "id": "dyeugsf",
            "is_submitter": false,
            "link_id": "t3_8guhqq",
            "parent_id": "t1_dyesw3f",
            "score": 3,
            "stickied": false,
            "author_name": "ptchinster"
        },
        "dyeug01": {
            "comment": "Weather I believe you or not, it's easy to google. Here is a method following the above concept: \n\nhttps://enigma0x3.net/2016/07/22/bypassing-uac-on-windows-10-using-disk-cleanup/ \n\nfrom 2016, using a method detailed in another blog post from 2014.\n\nThat method requires an admin account (for the file copy) and from it bypasses the UAC dialog, but there are other posts on that blog that are different. The author:\n\n* Looks at scheduled events to find one with high privileges\n* Uses process monitor to see what files it loads, or files it tries to load\n* Makes a malicious file that matches one\n* Gets higher privileges when it runs his code\n\n\nAnother way to find things is to wait for a security patch, see what it changes, and then develop an exploit that targets unpatched systems. There are plenty since nobody likes to update. ",
            "timeStamp": "2018/05/03-17:05:36",
            "id": "dyeug01",
            "is_submitter": false,
            "link_id": "t3_8guhqq",
            "parent_id": "t1_dyesw3f",
            "score": 3,
            "stickied": false,
            "author_name": "unnecessary_axiom"
        },
        "dyesw3f": {
            "comment": "But AFAIK, and obviously I am wrong, nothing like that (the first thing) exists. Can you give an example? (BTW I'm not writing malware, I'd just like to understand it).",
            "timeStamp": "2018/05/03-16:38:56",
            "id": "dyesw3f",
            "is_submitter": true,
            "link_id": "t3_8guhqq",
            "parent_id": "t1_dyesqks",
            "score": -5,
            "stickied": false,
            "author_name": "StevenC21"
        },
        "dyesqks": {
            "comment": "It depends what's available. \n\nIn an old version of windows the `at` command could scheduled a task at a certain time. It ran all of these tasks with system level privileges and anyone could schedule something. So if you scheduled it to launch a command prompt one minute in the future you'd have full access. \n\nIn current windows all you do is find something that executes code at a high privilege level and you're allowed to give input to. Maybe it runs a file you can write to, or there is a bug that lets you make it execute code you send it. ",
            "timeStamp": "2018/05/03-16:36:19",
            "id": "dyesqks",
            "is_submitter": false,
            "link_id": "t3_8guhqq",
            "parent_id": "t1_dyerfl2",
            "score": 7,
            "stickied": false,
            "author_name": "unnecessary_axiom"
        },
        "dyesf0g": {
            "comment": "With every system there is something called an \"attack surface.\"\n\nThat surface can be ports open on the network, where a service is behind that port waiting to accept traffic.  That surface can also be objects available in or called into memory, like 3rd party browser plugins, services, etc.\n\nSo any of these surfaces are simply things \"malware\" can talk to.  In most cases, those surfaces are fairly resilient to unconventional chatter...but in some cases a series of inputs or badly formed requests can cause the service or plugin behind the attack surface to crash or access parts of memory it also has access to.  And when that service or object is in a memory space with higher privilege, the malicious program can then use that space to carry out further actions.  This is privilege escalation.\n\nSo imagine a scenario where you're a standard user with standard rights....your question is, how can malware gain admin?  Well, through those attack surfaces!  (simplifying this a bit, but it's the general gist)",
            "timeStamp": "2018/05/03-16:30:41",
            "id": "dyesf0g",
            "is_submitter": false,
            "link_id": "t3_8guhqq",
            "parent_id": "t3_8guhqq",
            "score": 4,
            "stickied": false,
            "author_name": "ajeoae"
        },
        "dyeruxk": {
            "comment": "It doesn't necessarily want or even need admin rights. Most ransomware can run just fine without any administrator privileges. Most of the malware being written and shotgunned out there are things like this and coin miners that also don't need local admin.",
            "timeStamp": "2018/05/03-16:20:57",
            "id": "dyeruxk",
            "is_submitter": false,
            "link_id": "t3_8guhqq",
            "parent_id": "t3_8guhqq",
            "score": 5,
            "stickied": false,
            "author_name": "bluesoul"
        },
        "dyerfl2": {
            "comment": "But how do these \"exploits\" work? Is it secretly running some batch file or something?",
            "timeStamp": "2018/05/03-16:13:46",
            "id": "dyerfl2",
            "is_submitter": true,
            "link_id": "t3_8guhqq",
            "parent_id": "t1_dyeq2cr",
            "score": 1,
            "stickied": false,
            "author_name": "StevenC21"
        },
        "dyeq2cr": {
            "comment": "this is an ELI5:\n\nsometimes they use windows exploits to gain admin rights\n\nsometimes they simply just ask for the admin password under the guise of another piece of software\n\n",
            "timeStamp": "2018/05/03-15:50:18",
            "id": "dyeq2cr",
            "is_submitter": false,
            "link_id": "t3_8guhqq",
            "parent_id": "t3_8guhqq",
            "score": 16,
            "stickied": false,
            "author_name": "edward_snowedin"
        },
        "dyeq1j1": {
            "comment": "basically, any malware that gets into your system through downloads can be attributed to being your fault  \nif you went to a site and suddenly you were infected, you got hit by an exploit  \nmalware uses exploits in your system to enter it and or get admin privledges/steal your info/make you pay money for your files/make you cry at night/e.t.c  \nessentially, exploits are bugs that can cause unexpected code execution ",
            "timeStamp": "2018/05/03-15:49:54",
            "id": "dyeq1j1",
            "is_submitter": false,
            "link_id": "t3_8guhqq",
            "parent_id": "t3_8guhqq",
            "score": 2,
            "stickied": false,
            "author_name": "cronsundathar"
        }
    }
}