{
    "op": {
        "upvote_ratio": null,
        "selftext": "Hi there! We encountered a zero-day malware executable a few days ago, which I submitted to VirusTotal and Sophos, then purged from our systems (it was a ransomware executable, a variant of the Rapid Ransomware strain).\n\nAfter submission to VirusTotal, I wanted to submit the malware to JoeSandbox to find whether it communicated with any IPs, had any network traffic, etc. and/if where it could have sent files to a remote source but did not have an opportunity to after server cleanup was complete.\n\nThe URL of the file submitted is here:  [VirusTotal](https://www.virustotal.com/#/file/24dd1e8c31275cea88e28ceb2a1871dab928fdebcc144f606a4e611af22332bf/detection)\n\nIf anyone has a subscription to VirusTotal Intelligence, can you please upload the 'info.exe' file to JoeSandbox so I can look at the full PDF report? I'd like to know the full extent of the damage that may have occurred, and it would be really interesting to see the full malware behavior. In case anyone is curious, I also uploaded the decryptor's EXE which is linked to here. I was looking to get a full report of the EXE just like the one for the decryptor, below.\n\n [Automated Malware Analysis Report for FTS.exe - Generated by Joe Sandbox](https://www.joesandbox.com/analysis/124419/0/pdf) \n\nThanks so much for your assistance!",
        "title": "Can someone please upload this VirusTotal EXE to JoeSandbox for me?",
        "score": 1,
        "id": "bfxhop",
        "commsNum": 1,
        "timeStamp": "2019/04/21-20:36:24",
        "author_name": "danstheman7",
        "is_self": true,
        "locked": false,
        "num_comments": 1,
        "over_18": false,
        "spoiler": false,
        "subreddit": "malware",
        "stickied": false,
        "url": "https://www.reddit.com/r/Malware/comments/bfxhop/can_someone_please_upload_this_virustotal_exe_to/"
    },
    "posts": {
        "elh0rdm": {
            "comment": "It looks like you are posting a question, possibly looking for technical support. \n\nThis subreddit’s purpose is to discuss malware internals and technical details. *This is NOT a place for help with malware removal or various other end-user questions. Please redirect questions related to malware removal to /r/Antivirus or /r/techsupport. Ransomware related questions can be directed to /r/ransomware*\n\nIf this was removed in error, please message the moderators - we love reading quality content just as much as you do!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Malware) if you have any questions or concerns.*",
            "timeStamp": "2019/04/21-20:36:27",
            "id": "elh0rdm",
            "is_submitter": false,
            "link_id": "t3_bfxhop",
            "parent_id": "t3_bfxhop",
            "score": 1,
            "stickied": false,
            "author_name": "AutoModerator"
        }
    }
}