{
    "op": {
        "upvote_ratio": null,
        "selftext": "Some time ago I got a virus and my computer ended up installed Segurazo and a bootleg search bar on my desktop. I managed to get rid of Segurazo but the bootleg search bar was particulary stubborn and I had to reset my PC. It was a blue search bar that appeared on the top of my desktop and was like Google expect it had mushrooms as a logo. Can you help me identify this malware?\n\nThanks in advance!",
        "title": "Can you help me identify this malware?",
        "score": 1,
        "id": "ewvpn0",
        "commsNum": 1,
        "timeStamp": "2020/01/31-13:57:08",
        "author_name": "Idrossidodidrossido",
        "is_self": true,
        "locked": false,
        "num_comments": 1,
        "over_18": false,
        "spoiler": false,
        "subreddit": "malware",
        "stickied": false,
        "url": "https://www.reddit.com/r/Malware/comments/ewvpn0/can_you_help_me_identify_this_malware/"
    },
    "posts": {
        "fg4ov7m": {
            "comment": "It looks like you are posting a question, possibly looking for technical support. \n\nThis subreddit’s purpose is to discuss malware internals and technical details. *This is NOT a place for help with malware removal or various other end-user questions. Please redirect questions related to malware removal to /r/Antivirus or /r/techsupport. Ransomware related questions can be directed to /r/ransomware*\n\nIf this was removed in error, please message the moderators - we love reading quality content just as much as you do!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Malware) if you have any questions or concerns.*",
            "timeStamp": "2020/01/31-13:57:09",
            "id": "fg4ov7m",
            "is_submitter": false,
            "link_id": "t3_ewvpn0",
            "parent_id": "t3_ewvpn0",
            "score": 1,
            "stickied": false,
            "author_name": "AutoModerator"
        }
    }
}