{
    "op": {
        "upvote_ratio": null,
        "selftext": "**DISCLAIMER:** I am far from a tech wizard, but the engineer in me loves solving problems. So, my phrasing and terminology may require a *few* future edits. Also, I’m sure there’s a much simpler way of going about solving this issue, but I did what I could with the little information I had.\n\nThis post is for those who have **_”Goodgame Big Farm”_** installed on their computer, but it seems impossible to uninstall.\n\n**BACKGROUND:** I downloaded a program on my computer (Windows 10) that I probably shouldn’t have, and ended up with this game being installed on my computer, in the background, unauthorized by myself. When I noticed the game in my *Control Panel* under the *Apps and features* tab, I obviously didn’t recognize it but didn’t think too much of it... until I tried to uninstall it. Hit the *uninstall* button, it asked if I wanted *Windows Command Processor* (C:\\WINDOWS\\System32\\cmd.exe) to make changes to my hard drive, I thoughtlessly clicked *”Yes”*. Normally, running cmd.exe will open the command prompt with Microsoft’s copyright stamp at the top. There was no stamp. The file locations (yes, **_more than one_**) appeared to include about 4-5 other locations deep in *Users\\•••••\\AppData\\Roaming*. That’s when I knew something was up, but I didn’t know exactly *what* was up. So, if you find yourself in this same predicament, here are the steps I took to solve the problem, as the internet seems to have little-to-no information for my exact situation. I found https://www.google.com/amp/s/howtoremove.guide/big-farm-virus-remove/amp/ to be rather helpful in this process, but I will go more in-depth into **Step 5** for the other non-tech-wizards like me.\n\n**BEFORE YOU BEGIN:** Open the *Task Manager* by right-clicking on the taskbar at the bottom of the screen. When it opens, select the *Details* tab at the top of the window. Scroll through the list and find any program with *Goodgame* in its name, right-click on it, and select *End task*.\n\n**STEP 1:** Open *File Explorer*, and click on *This PC*. Under *Devices and drives*, click on *Windows (C:)*. \n\n**STEP 2:** From there, the easiest way to complete the next process is to search *”Goodgame”* in the search bar in the upper right-hand corner of the window. It’s going to take some time for it to display every file, so just be patient. (*If there are no files to be displayed, which was the case for me, skip to **STEP 5**)\n\n**STEP 2.5:** If the displayed files have *Date modified:* either under the file name or on the right side of the window, write down the exact date and time and set it aside for later.\n\n**STEP 3:** Every single file that you see with *”Goodgame”* highlighted in yellow needs to be **_deleted_**. \n\n**STEP 4:** Now, you may still see *Goodgame Big Farm* under your *Apps and features* settings menu. If so, try to uninstall it again. If that still doesn’t work, which it’s likely not going to, continue along.\n\n**STEP 5:** Press and hold the **Windows/Start  + R** buttons at the same time to open the Run menu. In the search field, type **Regedit**. Hit *enter*. Yes, allow it to make changes to your device.\n\n**Here comes the tedious part**\n\n**STEP 6:** In the drop down menu on the left of the window, make sure *Computer* is highlighted in blue. Press and hold the **CTRL + F** buttons at the same time, opening the Find menu. In the search bar, type **Goodgame**, check the 3 boxes under *Look at:* (Keys, Values, Data) (*leave “Match whole string only” **unchecked***) and then hit *Enter*, or click *Find Next*.\n\n**STEP 7:** Files will appear; sometimes 1 file, sometimes 20. Highlighted in blue is going to be a registry key file for the game. Right-click on the file and select *”Delete”*. Scroll through the other items in the list, looking for **_Goodgame_** somewhere either in the *name* of the file, or to the right under *data*. Right-click/highlight *any* and *all* registry key files in that window that contain the word **_”Goodgame”_** and delete them. A scary warning will appear, stating that it could cause “system instability”; *it won’t hurt your computer*. **_You must banish all “Goodgame” key files to the depths of hell from which they came._**\n\n**STEP 8:** You’re going to repeat steps 6 and 7, making sure you click on *Computer* before **every** search. You may have to do this upwards of 30 times until **every** key file is deleted. \n\n**Pro Tip:** The fastest way to do this is with a repetitive sequence of keystrokes; **CTRL+F, Enter, Delete, Enter**\n\n**STEP 9:** When you finally see that illustrious *”Finished Search”* pop-up, go back to the control panel and see if **”Goodgame Big Farm”** is still there. *Watch it disappear before your very eyes.* **_Cry a tear of triumph._**\n\n**Remember the date and time you wrote down earlier?** Now you’re going to do this again for the program you *initially intended* to download that brought this ^*lovely* game into your life by matching the *Goodgame* date and time with other installed programs. \n\nIf anyone is confused by my instructions, I will happily clarify and edit this post, as well as guide you step-by-step.",
        "title": "How To Remove Goodgame Big Barn Malware",
        "score": 1,
        "id": "ezpual",
        "commsNum": 0,
        "timeStamp": "2020/02/06-01:16:41",
        "author_name": "OfficerSweatervest",
        "is_self": true,
        "locked": false,
        "num_comments": 0,
        "over_18": false,
        "spoiler": false,
        "subreddit": "malware",
        "stickied": false,
        "url": "https://www.reddit.com/r/Malware/comments/ezpual/how_to_remove_goodgame_big_barn_malware/"
    },
    "posts": {}
}