{
    "op": {
        "upvote_ratio": null,
        "selftext": "Well uh, sad story. I mean you do not care about this but i feel like telling it to someone might help me feel better. \n\nI got my new gaming PC a month ago. I never had any PC (only some laptops) and this thing was everything to me. \nI always work for something if i want it, and this year i had all straight A's, and was hard working, so my dad decided to buy it for me! Sadly, today i turned it on and started up a game i really liked, and the PC acted weird. It would often do the blue rotating thing next to my mouse arrow but i was in full screen and could not see what is going on. When i left the game there was shit ton of hentai tabs open, some invisible setups, updates, and all my files became NPPP. There was a message in my files saying that i can have them all back for like +$900 and bunch of random Chineese text. I managed to get rid of the virus but all that i had downloaded on it is gone. Thankfully i have a backup of my photos at least... sorry if this disturbs you or does not belong here, i just feel so bad about it. I will reinstall the system and i hope this never happens again. \n\nPlease take care of what you are doing online and do not pirate stuff 🙏 stay safe out there guys.",
        "title": "Lost my brand new gaming PC to a virus...",
        "score": 1,
        "id": "fa22n0",
        "commsNum": 3,
        "timeStamp": "2020/02/26-14:58:58",
        "author_name": "TastyTea420",
        "is_self": true,
        "locked": false,
        "num_comments": 3,
        "over_18": false,
        "spoiler": false,
        "subreddit": "malware",
        "stickied": false,
        "url": "https://www.reddit.com/r/Malware/comments/fa22n0/lost_my_brand_new_gaming_pc_to_a_virus/"
    },
    "posts": {
        "fiwxlsa": {
            "comment": "I will, thanks for the advice. I lost some important files that i didnt have backed up but at least all of my photos were on a USB stick.",
            "timeStamp": "2020/02/27-04:34:52",
            "id": "fiwxlsa",
            "is_submitter": true,
            "link_id": "t3_fa22n0",
            "parent_id": "t1_fivd6jm",
            "score": 1,
            "stickied": false,
            "author_name": "TastyTea420"
        },
        "fivdnyg": {
            "comment": "*cough* linux",
            "timeStamp": "2020/02/26-15:07:54",
            "id": "fivdnyg",
            "is_submitter": false,
            "link_id": "t3_fa22n0",
            "parent_id": "t3_fa22n0",
            "score": 2,
            "stickied": false,
            "author_name": "Smeggmashart"
        },
        "fivd6jm": {
            "comment": "Did you even lose much if it was brand new? Invest in AV with anti-ransomware or learn how to use Windows Defenders anti ransomware. Back your shit up. change your passwords.",
            "timeStamp": "2020/02/26-15:03:52",
            "id": "fivd6jm",
            "is_submitter": false,
            "link_id": "t3_fa22n0",
            "parent_id": "t3_fa22n0",
            "score": 3,
            "stickied": false,
            "author_name": "nre_graphico"
        }
    }
}