{
    "op": {
        "upvote_ratio": 1.0,
        "selftext": "You can safely download best free Antivirus software developed for Windows 10 from our website. Windows Defender installed on Windows 10 by default is not always sufficiently effective in detecting and removing viruses and protecting computers from infection. Protection of the computer from viruses and cyber-attacks has vital importance for online shopping, FTP file transfer process, online banking and financing. Yet even online strategy games probe a risk of virus infection targeting the operating systems so the free Antivirus for Windows 10 software carries a crucial importance. This importance urged us to evaluate the variety of Antivirus software to recommend you the best one for your needs. We evaluated 25 different programs for this purpose and now we introduce 5 of them for our followers including Norton, Kaspersky, AVG, Bitdefender and ESET® NOD32.\n\nWe have run several different types of tests to figure out the best antivirus software. After having the results, we were surprised to see that the best spyware and virus detecting software is different than previous year. The results were always changing every year but the top 5 would never change. After all, the most reliable software of 2019 is turned out to be Norton for Windows 10. However, another program may be a better choice for you depending on your environment such as business or home usage. You can decide which of the following 5 recommended programs is best for your needs and protection type and then download on your computer.\n\nSource: https://2013download.com/free-antivirus-for-windows-10/",
        "title": "You can safely download best free Antivirus software developed for Windows 10 from our website.",
        "score": 1,
        "id": "hns33w",
        "commsNum": 3,
        "timeStamp": "2020/07/08-16:28:05",
        "author_name": "1aleynatilki",
        "is_self": true,
        "locked": false,
        "num_comments": 3,
        "over_18": false,
        "spoiler": false,
        "subreddit": "malware",
        "stickied": false,
        "url": "https://www.reddit.com/r/Malware/comments/hns33w/you_can_safely_download_best_free_antivirus/"
    },
    "posts": {
        "fxdarr9": {
            "comment": "You need to download the popup extension at  [https://2013download.com/free-antipopup-for-windows-10/](https://2013download.com/free-antivirus-for-windows-10/)",
            "timeStamp": "2020/07/08-16:48:19",
            "id": "fxdarr9",
            "is_submitter": false,
            "link_id": "t3_hns33w",
            "parent_id": "t1_fxd9hkw",
            "score": 1,
            "stickied": false,
            "author_name": "TParis00ap"
        },
        "fxd9m66": {
            "comment": "[deleted]",
            "timeStamp": "2020/07/08-16:37:27",
            "id": "fxd9m66",
            "is_submitter": false,
            "link_id": "t3_hns33w",
            "parent_id": "t3_hns33w",
            "score": 1,
            "stickied": false,
            "author_name": "[deleted]"
        },
        "fxd9hkw": {
            "comment": "I downloaded it. Its not blocking all of the pop-ups. Id say I have even more now. I have my Webcam cover off if you want to watch though. 😉",
            "timeStamp": "2020/07/08-16:36:28",
            "id": "fxd9hkw",
            "is_submitter": false,
            "link_id": "t3_hns33w",
            "parent_id": "t3_hns33w",
            "score": 2,
            "stickied": false,
            "author_name": "heidenbeiden"
        }
    }
}