{
    "op": {
        "upvote_ratio": 1.0,
        "selftext": "I am considering perusing a career in RE, I have a basic knowledge regarding cyber security and malware and vaguely familiar with IDA pro and OlyDBG\n\nthe following are my questions :\n\n1) what is the average pay for RE jobs (as a freelancer or job)?\n\n2) is only antivirus co. are interested in REers or are there other fields?\n\n3) is the best way to break into RE is to focus on RE malware or are there other avenues?\n\n4) if I get hired or contracted as an RE what will I be asked to do (other than basically de-compiling the assembly)?\n\n5) what are the knowledge (books, courses and certificates) I will need to be considered as a qualified candidate?\n\n6) how can I build my portfolio and my experience in RE (things to add on a resume for recruiters to see like github projects for developers)?\n\n7) is it a viable career choice to make a stable living?",
        "title": "perusing a career in RE",
        "score": 1,
        "id": "i1duy6",
        "commsNum": 29,
        "timeStamp": "2020/07/31-12:28:44",
        "author_name": "AStableNomad",
        "is_self": true,
        "locked": false,
        "num_comments": 29,
        "over_18": false,
        "spoiler": false,
        "subreddit": "malware",
        "stickied": false,
        "url": "https://www.reddit.com/r/Malware/comments/i1duy6/perusing_a_career_in_re/"
    },
    "posts": {
        "g00n353": {
            "comment": "Exactly. Automation is just there is produce data for an RE to analyze. From it we can try to identify what family the malware is and its basic components. Sometimes we can't. Sometimes it won't run unless a specific version of Office is installed (like one we saw this week). Or needs to connect to a certain web site. And, even if it connected, that same malware may have a list of other backup servers to connect to. Without RE, those backup servers wouldn't be found because automation only found the first.\n\nFrom there we can build upon static analysis with YARA rules and the like to try and identify what family of malware it belongs to, then use that group it into larger trends. e.g. is it yet another Emotet, or is it Emotet with major evolutions. Or did a new actor fork a known ransomware for themselves. All of those require dedicated RE.",
            "timeStamp": "2020/08/01-13:04:14",
            "id": "g00n353",
            "is_submitter": false,
            "link_id": "t3_i1duy6",
            "parent_id": "t1_fzzph8v",
            "score": 1,
            "stickied": false,
            "author_name": "LightningRurik"
        },
        "g002o4m": {
            "comment": "This, people gravitate so quickly to too narrow a view on what REs do and it helps to give people ideas about how big the field really is.",
            "timeStamp": "2020/08/01-10:19:06",
            "id": "g002o4m",
            "is_submitter": false,
            "link_id": "t3_i1duy6",
            "parent_id": "t1_fzzpckt",
            "score": 1,
            "stickied": false,
            "author_name": "eagle33322"
        },
        "g002juv": {
            "comment": "SO much this",
            "timeStamp": "2020/08/01-10:18:02",
            "id": "g002juv",
            "is_submitter": false,
            "link_id": "t3_i1duy6",
            "parent_id": "t1_fzxsxha",
            "score": 1,
            "stickied": false,
            "author_name": "eagle33322"
        },
        "fzzpypu": {
            "comment": "[removed]",
            "timeStamp": "2020/08/01-08:31:57",
            "id": "fzzpypu",
            "is_submitter": false,
            "link_id": "t3_i1duy6",
            "parent_id": "t1_fzxlaa2",
            "score": 1,
            "stickied": false,
            "author_name": "[deleted]"
        },
        "fzzph8v": {
            "comment": "Thanks.",
            "timeStamp": "2020/08/01-08:28:12",
            "id": "fzzph8v",
            "is_submitter": false,
            "link_id": "t3_i1duy6",
            "parent_id": "t1_fzzpckt",
            "score": 1,
            "stickied": false,
            "author_name": "ndetro"
        },
        "fzzpckt": {
            "comment": "&gt; As the threat of malware has grown Continuingly throughout the decades, manually reverse engineering malware for a company like nod32, avast, or avg, etc., wouldn't do that simply because that type of operation would not be sustainable.\n\nWut? AV teams have dozens, if not hundreds, of reverse engineers working for them. That's how you get 100% efficacy on malware. They are constantly reversing new malware as there are still a constant amount that just do not detonate in VMs. \n\nDisclaimer: I'm an RE at an AV company that is constantly reviewing new malware and techniques that bypass everything. There are thousands of people in my field.",
            "timeStamp": "2020/08/01-08:27:22",
            "id": "fzzpckt",
            "is_submitter": false,
            "link_id": "t3_i1duy6",
            "parent_id": "t1_fzxlaa2",
            "score": 1,
            "stickied": false,
            "author_name": "LightningRurik"
        },
        "fzz51n3": {
            "comment": "thankss",
            "timeStamp": "2020/08/01-04:42:47",
            "id": "fzz51n3",
            "is_submitter": false,
            "link_id": "t3_i1duy6",
            "parent_id": "t1_fzz09cg",
            "score": 1,
            "stickied": false,
            "author_name": "faucetfailure_0"
        },
        "fzz09cg": {
            "comment": "Yep, and sometimes orgs will outsource the testing of software to an external team (one way to conduct black box testing). There are also roles for just “vulnerability researchers” who do this kind of testing on products.\n\nRe:Malware Analysis resumes, it really depends on the org and whether they want someone JUST dedicated to malware analysis, or if they are looking for someone to serve more generally as a SOC or incident response analyst. \n\nFor the latter case, they’ll want to see you have familiarity with tools used for incident response (SIEMs, forensics tools, ticketing/documentation systems, etc) and may require some certifications like Security+, Network+, or CySA+. \n\nFor the former - a straight malware analyst role - they may require knowledge of malware analysis methodologies/tools, great documentation skills (this goes for most roles), and maybe a degree or cert like CEH or GREM. \n\nA good way to determine what a resume should look like is to search for open roles for whatever path you’re interested in and see what skills recruiters are looking for (keeping in mind that they tend to ask for more than they need).\n\nTake these two for example: I just did a quick search for a role for vulnerability research/malware analysis and another for a more general SOC role:\n\n\nhttps://www.indeed.com/m/viewjob?jk=2bda11b1167a7f36&amp;from=serp&amp;prevUrl=https%3A%2F%2Fwww.indeed.com%2Fm%2Fjobs%3Fq%3DEntry%2BLevel%2BMalware%2BAnalyst\n\nhttps://www.indeed.com/m/viewjob?jk=7c3f5ee8cadb58aa&amp;from=serp&amp;prevUrl=https%3A%2F%2Fwww.indeed.com%2Fm%2Fjobs%3Fq%3DSoc%2BAnalyst",
            "timeStamp": "2020/08/01-03:20:02",
            "id": "fzz09cg",
            "is_submitter": false,
            "link_id": "t3_i1duy6",
            "parent_id": "t1_fzyff7q",
            "score": 1,
            "stickied": false,
            "author_name": "0xFF0F"
        },
        "fzyto7c": {
            "comment": "[removed]",
            "timeStamp": "2020/08/01-01:22:36",
            "id": "fzyto7c",
            "is_submitter": false,
            "link_id": "t3_i1duy6",
            "parent_id": "t3_i1duy6",
            "score": 1,
            "stickied": false,
            "author_name": "[deleted]"
        },
        "fzyff7q": {
            "comment": "aren't finding bugs and vulnerabilities in code a software tester's job?? and what set of skills are critical in a malware analysts resume? do you have any examples of resumes like that??",
            "timeStamp": "2020/07/31-21:49:20",
            "id": "fzyff7q",
            "is_submitter": false,
            "link_id": "t3_i1duy6",
            "parent_id": "t1_fzy47g1",
            "score": 1,
            "stickied": false,
            "author_name": "faucetfailure_0"
        },
        "fzy47g1": {
            "comment": "So, I’m going to take this in a bit different direction here, but I think there are a couple of things that have been left unsaid so far in the answers that could be useful to you:\n\nFirst, you say you are interested in reverse engineering - that’s awesome! But are you only interested in RE as a method of malware analysis?\n\nIf so, keep in mind that RE is just one of several techniques used for malware analysis - As others have mentioned, sandboxes (automated or interactive) are another, as is static and dynamic analysis. \n\nIf you are interested in malware analysis, you can think of these methods as different tiers in a malware analysis skill set pyramid: At the bottom (least experience/effort needed), completely automated sandboxes. Then static analysis using tools (need more knowledge of what to look for, but don’t need RE experience to use these tools). Then dynamic analysis (requires a bit more knowledge of debugging and patching programs, but even then there are tools that can help). \n\nThen, at the very top, you have RE - it takes the most time and requires particular knowledge, but it can be learned even without a dev background, and produces the most valuable outputs from malware analysis. \n\nIf you want to do just RE, you’ll also want to learn the other tiers of this “pyramid” so that instead, you can market yourself as a malware analyst with RE experience. Certs are great, but expensive, so you could instead start a blog or GitHub repo with your RE/malware analysis work and really demonstrate your value in extracting information that can be used to learn about and defend against malware. \n\nNow, on the other hand, one thing I haven’t seen touched on here are the other applications of RE: RE is a very desirable skill set in the gaming and, more generally, software industry for anti-cheat development and secure code analysis. By code analysis, I mean RE is also desirable for someone who is working to find bugs/vulnerabilities in software. \n\nThese are some alternative career paths outside of malware that you could consider. But regardless of which area you find most interesting, be prepared to expand your skill set to include other complementary skills (like the other tiers of malware analysis or software development principles, etc.)\n\nI hope that helps and feel free to DM me if you have questions about these different career paths; I work primarily in malware but have some peers who do RE for secure coding and anti-cheat. \n\nBest of luck and share your work sometime!",
            "timeStamp": "2020/07/31-19:44:15",
            "id": "fzy47g1",
            "is_submitter": false,
            "link_id": "t3_i1duy6",
            "parent_id": "t3_i1duy6",
            "score": 2,
            "stickied": false,
            "author_name": "0xFF0F"
        },
        "fzy1830": {
            "comment": "Through my experience, RE is mainly an ancillary skill set for a tier 3/4 DFIR analyst.",
            "timeStamp": "2020/07/31-19:13:53",
            "id": "fzy1830",
            "is_submitter": false,
            "link_id": "t3_i1duy6",
            "parent_id": "t3_i1duy6",
            "score": 2,
            "stickied": false,
            "author_name": "Trentifus"
        },
        "fzxyp9z": {
            "comment": "[removed]",
            "timeStamp": "2020/07/31-18:48:22",
            "id": "fzxyp9z",
            "is_submitter": false,
            "link_id": "t3_i1duy6",
            "parent_id": "t3_i1duy6",
            "score": 1,
            "stickied": false,
            "author_name": "[deleted]"
        },
        "fzxsxha": {
            "comment": "You say it will be patched, and it will. But you have to realize, Malware is not just a computer. Computers will do the exact same thing over and over to get a result, without adapting to its enviornment. There are people behind this. They see something is patched? there is a NEW way to get the result. And plus, there are malware that can detect whether its in a vm, and it can penetrate through the vm and get on your computer. Or it just wont execute at all. So if there are ways to get around a vm, im sure there will be a way to get out of a sand box.",
            "timeStamp": "2020/07/31-17:51:16",
            "id": "fzxsxha",
            "is_submitter": false,
            "link_id": "t3_i1duy6",
            "parent_id": "t1_fzxlaa2",
            "score": 3,
            "stickied": false,
            "author_name": "Interesting-Bus-5370"
        },
        "fzxn9pf": {
            "comment": "K.",
            "timeStamp": "2020/07/31-17:01:50",
            "id": "fzxn9pf",
            "is_submitter": false,
            "link_id": "t3_i1duy6",
            "parent_id": "t1_fzxmxwe",
            "score": -1,
            "stickied": false,
            "author_name": "ndetro"
        },
        "fzxmxwe": {
            "comment": "You are thinking about this way to narrow-minded I will no longer are argue with some random person on the internet that admitted they think \"all malware families are the same and behave the same way\"",
            "timeStamp": "2020/07/31-16:59:08",
            "id": "fzxmxwe",
            "is_submitter": false,
            "link_id": "t3_i1duy6",
            "parent_id": "t1_fzxlaa2",
            "score": 2,
            "stickied": false,
            "author_name": "Wouldratherplaymtg"
        },
        "fzxlbgt": {
            "comment": "[removed]",
            "timeStamp": "2020/07/31-16:45:57",
            "id": "fzxlbgt",
            "is_submitter": false,
            "link_id": "t3_i1duy6",
            "parent_id": "t1_fzxlaa2",
            "score": 1,
            "stickied": false,
            "author_name": "[deleted]"
        },
        "fzxlaa2": {
            "comment": "That is not new. It will be patched. Using an office application macro exploit has been around for a long time. I bet in any.run, changing the spec of the system would break that detection. For example, the malware author most likely uploaded his bypass to the free version of any.run and kept pulling data about the machine. (Win7 32bit). Found a static name or Id on the computer and is using this to bypass that specific vendor. If you had an enterprise subscription to any.run and changed the sandbox too, let’s say, win10 64bit with different apps; I bet it would break that detection. My argument is that if OP wants to be a hobbyist malware RE, go for it. Though, this is most likely automated professionally. As the threat of malware has grown Continuingly throughout the decades, manually reverse engineering malware for a company like nod32, avast, or avg, etc., wouldn't do that simply because that type of operation would not be sustainable. With that being said, I bet the government has a team of them in their respective departments combating foreign nation attacks. The outliers Like stuxnet.",
            "timeStamp": "2020/07/31-16:45:43",
            "id": "fzxlaa2",
            "is_submitter": false,
            "link_id": "t3_i1duy6",
            "parent_id": "t1_fzx6is1",
            "score": 0,
            "stickied": false,
            "author_name": "ndetro"
        },
        "fzxk1kk": {
            "comment": "This is a good start to learn RE:\n\nhttps://www.navneetmuffin.in/reverse_engineering/2020/02/08/become-reverse-engineer.html\n\nFor malware, a good cert to get would be SANS FOR610 GREM.",
            "timeStamp": "2020/07/31-16:35:37",
            "id": "fzxk1kk",
            "is_submitter": false,
            "link_id": "t3_i1duy6",
            "parent_id": "t3_i1duy6",
            "score": 1,
            "stickied": false,
            "author_name": "Lemons30"
        },
        "fzxfu78": {
            "comment": "Your RE knowledge would likely best supplement DFIR skills. There's a bigger demand for that (e.g. FireEye/Mandiant, Deloitte/EY and maybe other big4). You can certainly find a niche within RE in a DFIR role, but you need to be solid in your DFIR skills to get your foot in the door.\n\nAs far as certs: GCFA, GCFE, and/or GCIH. Really expensive but you will learn more from one of their courses than most undergrad cybersecurity programs. \n\n[https://www.giac.org/certifications/digital-forensics](https://www.giac.org/certifications/digital-forensics)",
            "timeStamp": "2020/07/31-16:02:09",
            "id": "fzxfu78",
            "is_submitter": false,
            "link_id": "t3_i1duy6",
            "parent_id": "t3_i1duy6",
            "score": 2,
            "stickied": false,
            "author_name": "StupidTinyFatUnicorn"
        },
        "fzx6is1": {
            "comment": "No I'm not sure I'm just arguing a point for the fun of it....\n\nhttps://www.google.com/amp/s/www.bleepingcomputer.com/news/security/malware-adds-online-sandbox-detection-to-evade-analysis/amp/",
            "timeStamp": "2020/07/31-15:04:38",
            "id": "fzx6is1",
            "is_submitter": false,
            "link_id": "t3_i1duy6",
            "parent_id": "t1_fzx62nt",
            "score": 1,
            "stickied": false,
            "author_name": "Wouldratherplaymtg"
        },
        "fzx62nt": {
            "comment": "Are you sure? Maybe for not for something like stuxnet, but nearly all malware has an end goal, and nearly all behave similarly in the way they do it. \n\nDo you have an example of a modern evasion technique?",
            "timeStamp": "2020/07/31-15:02:07",
            "id": "fzx62nt",
            "is_submitter": false,
            "link_id": "t3_i1duy6",
            "parent_id": "t1_fzwvzc6",
            "score": 1,
            "stickied": false,
            "author_name": "ndetro"
        },
        "fzwyhrs": {
            "comment": "[removed]",
            "timeStamp": "2020/07/31-14:22:31",
            "id": "fzwyhrs",
            "is_submitter": false,
            "link_id": "t3_i1duy6",
            "parent_id": "t3_i1duy6",
            "score": 1,
            "stickied": false,
            "author_name": "[deleted]"
        },
        "fzwvzc6": {
            "comment": "Automated sandboxing works great for you typical rat or Kellogger but i don't believe automated re will ever ne what c levels would like",
            "timeStamp": "2020/07/31-14:10:06",
            "id": "fzwvzc6",
            "is_submitter": false,
            "link_id": "t3_i1duy6",
            "parent_id": "t1_fzwsmq3",
            "score": 1,
            "stickied": false,
            "author_name": "Wouldratherplaymtg"
        },
        "fzwsmq3": {
            "comment": "Perhaps. But, I have seen some insane behavior heuristic sandboxes that are not quite well-known to malware developers. I haven’t been in this field for a long time so I could be completely wrong. Like 5 years ago you could check the OS name, Hardware ID, GEO-location, or even had a time-lock algorithm that delayed payload execution until the typical timeout for sandboxes(1m 30s). Now I’m sure it is rather hard to fool a modern sandbox like cuckoo or run.any. Though I MAY be completely wrong.",
            "timeStamp": "2020/07/31-13:47:55",
            "id": "fzwsmq3",
            "is_submitter": false,
            "link_id": "t3_i1duy6",
            "parent_id": "t1_fzwmr5t",
            "score": 1,
            "stickied": false,
            "author_name": "ndetro"
        },
        "fzwrwiv": {
            "comment": "[deleted]",
            "timeStamp": "2020/07/31-13:41:54",
            "id": "fzwrwiv",
            "is_submitter": false,
            "link_id": "t3_i1duy6",
            "parent_id": "t1_fzwlw6p",
            "score": 1,
            "stickied": false,
            "author_name": "[deleted]"
        },
        "fzwmr5t": {
            "comment": "Sandboxes are constently being duped by malware. It will always need hands on",
            "timeStamp": "2020/07/31-12:59:48",
            "id": "fzwmr5t",
            "is_submitter": false,
            "link_id": "t3_i1duy6",
            "parent_id": "t1_fzwlw6p",
            "score": 3,
            "stickied": false,
            "author_name": "Wouldratherplaymtg"
        },
        "fzwlw6p": {
            "comment": "Isn’t a lot of this stuff automated with sandboxes now a days?",
            "timeStamp": "2020/07/31-12:52:31",
            "id": "fzwlw6p",
            "is_submitter": false,
            "link_id": "t3_i1duy6",
            "parent_id": "t3_i1duy6",
            "score": 1,
            "stickied": false,
            "author_name": "ndetro"
        },
        "fzwlo44": {
            "comment": "[removed]",
            "timeStamp": "2020/07/31-12:50:36",
            "id": "fzwlo44",
            "is_submitter": false,
            "link_id": "t3_i1duy6",
            "parent_id": "t3_i1duy6",
            "score": 1,
            "stickied": false,
            "author_name": "[deleted]"
        }
    }
}