{
    "op": {
        "upvote_ratio": 1.0,
        "selftext": "I clicked a link that a bot (most likely, might have a been a person fcking with me) sent me trough reddit. It happened when I got a notification from a user that started following me. I'm kind of a loner and I got curious and clicked his/her/the bot's profile. \n\nOn the profile was a REDDIT LINK. I kid you not. It was a reddit link. I clicked it and it led me to 'one of those' dating websites. You probably know what I mean with 'one of those'. Im sure everybody has them im in their own languages. It was even written in my own language: dutch.\n\nI never knew it was possible to hide links like this, maybe I did, but I wasnt aware of it at the moment. Probably because I'm tripping balls at the moment, heck do I know lmao. Anyways I'm rambling.\n\nImmediatly as soon as I clicked the link I got extremely paranoid and went into this thought-loop.\n\n&amp;#x200B;\n\nAnyways the actual question is: Is it possible that by just clicking on one of these links and getting on that website (I have fast internet so I did get on the website), you infect your phone with malware/a virus? I have done a malwarebytes scan at the moment. And I know it's probably fine. But I'm a drug addict and I can't trust my own head/thoughts at the moment. Hence why I'm here asking this question.\n\n&amp;#x200B;\n\nGreetings,\n\nYa boiii Blazey\n\n&amp;#x200B;\n\nTL/DR: I'll make a TLDR tomorrow because ATM I'm waay too lazy and I know theres enough people on the internet that actually fully reads these essays hahaha.",
        "title": "Malware trough JUST clicking on a bot/person's link on android",
        "score": 1,
        "id": "kjpstn",
        "commsNum": 8,
        "timeStamp": "2020/12/24-16:21:38",
        "author_name": "Blazey0902",
        "is_self": true,
        "locked": false,
        "num_comments": 8,
        "over_18": false,
        "spoiler": false,
        "subreddit": "malware",
        "stickied": false,
        "url": "https://www.reddit.com/r/Malware/comments/kjpstn/malware_trough_just_clicking_on_a_botpersons_link/"
    },
    "posts": {
        "ggya6rm": {
            "comment": "Anyways I'll research into that bruh thank you for your comment!",
            "timeStamp": "2020/12/24-17:44:45",
            "id": "ggya6rm",
            "is_submitter": true,
            "link_id": "t3_kjpstn",
            "parent_id": "t1_ggy9h3y",
            "score": 1,
            "stickied": false,
            "author_name": "Blazey0902"
        },
        "ggya5yo": {
            "comment": "I'm assuming you mean 'Link RevEAler' (no I'm not meme-ing, I'm not that type of person hahah, just wanted to see if you indeed made a typing mistake",
            "timeStamp": "2020/12/24-17:44:30",
            "id": "ggya5yo",
            "is_submitter": true,
            "link_id": "t3_kjpstn",
            "parent_id": "t1_ggy9h3y",
            "score": 1,
            "stickied": false,
            "author_name": "Blazey0902"
        },
        "ggy9h3y": {
            "comment": "A link reveler for Android? I'm not super familiar with mobile, at least not enough to know how to find one of those (if it even exists for that platform).  \nI wish you luck though. Hopefully someone else might have an idea.",
            "timeStamp": "2020/12/24-17:36:32",
            "id": "ggy9h3y",
            "is_submitter": false,
            "link_id": "t3_kjpstn",
            "parent_id": "t1_ggy6x54",
            "score": 1,
            "stickied": false,
            "author_name": "Draygoes"
        },
        "ggy6x54": {
            "comment": "Thank you bro. I sent a request to malwareremoval to post it there too but I dont think I'll need it, maybe in the future. \n\nAlso how can I refrain this from happening in the future (e.g. me clicking another one of these links)?\n\nJust follow the NR. 1 rule, don't click links by people you dont fully know? \n\nOr is there a way on android/PC to tell that such link is a fake link? Because I couldnt tell in the state I am on my android phone (which is not sober hahaha).",
            "timeStamp": "2020/12/24-17:07:54",
            "id": "ggy6x54",
            "is_submitter": true,
            "link_id": "t3_kjpstn",
            "parent_id": "t1_ggy4s41",
            "score": 1,
            "stickied": false,
            "author_name": "Blazey0902"
        },
        "ggy6srz": {
            "comment": "Also how can I refrain this from happening in the future (e.g. me clicking another one of these links). \n\nJust follow the NR. 1 rule, don't click links by people you dont fully know? Or is there a way on android/PC to tell that such link is a fake link?",
            "timeStamp": "2020/12/24-17:06:35",
            "id": "ggy6srz",
            "is_submitter": true,
            "link_id": "t3_kjpstn",
            "parent_id": "t1_ggy3tbb",
            "score": 1,
            "stickied": false,
            "author_name": "Blazey0902"
        },
        "ggy626f": {
            "comment": "1. Sorry about number one. As I said I'm tripping balls at the moment and I just needed some quick thought-relief or so to say. I am alone and I have no trip sitter at the moment.\n\n2. Excactly what I thought, only you confirmed it because you're probably a professional in this field. Judging by your comment it seems so at least. Haha.\n\n&amp;#x200B;\n\nMaybe we can talk about this in DM?",
            "timeStamp": "2020/12/24-16:58:30",
            "id": "ggy626f",
            "is_submitter": true,
            "link_id": "t3_kjpstn",
            "parent_id": "t1_ggy3tbb",
            "score": 1,
            "stickied": false,
            "author_name": "Blazey0902"
        },
        "ggy4s41": {
            "comment": "That's well enough said that I don't have anything super useful to add to your statement.  \nr/malwareremoval would have been a better place to ask a question like this.",
            "timeStamp": "2020/12/24-16:44:32",
            "id": "ggy4s41",
            "is_submitter": false,
            "link_id": "t3_kjpstn",
            "parent_id": "t1_ggy3tbb",
            "score": 1,
            "stickied": false,
            "author_name": "Draygoes"
        },
        "ggy3tbb": {
            "comment": "Two things: \n\n1. r/malware isn't for malware tech support.\n2. You're probably fine.  The kind of exploits needed to breach a device in one click are incredibly valuable, so much so that they're normally only used for targeted attacks so that they remain undiscovered.  The odds of someone wasting such an exploit on random people is extremely slim.  Their likely end goal with their spam campaign is to make a few quick bucks from affiliate links or people accidentally clicking ads on the destination page.",
            "timeStamp": "2020/12/24-16:33:38",
            "id": "ggy3tbb",
            "is_submitter": false,
            "link_id": "t3_kjpstn",
            "parent_id": "t3_kjpstn",
            "score": 1,
            "stickied": false,
            "author_name": "Browsing_From_Work"
        }
    }
}