{
    "op": {
        "upvote_ratio": 1.0,
        "selftext": "I recently submitted this information to several cyber companies after a 4 year investigation and would like to share it with you all, in hopes, to help.\n\nThe cyber criminals seem to be using a model of attack that looks very similar to models used by APT3, APT28, 29 and so forth, but these criminals are operating in Southern California and left physical evidence after break-ins were discovered. \n\nTheir model of attack uses [HyperGame Theory Model of deception](https://www.researchgate.net/publication/283166367_Hypergame_Theory_A_Model_for_Conflict_Misperception_and_Deception) as a basis and may be going after targets throughout Southern California and pointing blame, by use of model, towards other documented Cyber Offensive Groups such as the [Dukes](https://blog.f-secure.com/the-dukes-7-years-of-russian-cyber-espionage/). Anyway, I am going to paste a recent email that I've sent to a few cyber companies about this newly undocumented cyber model that was discovered. If you're the right person, you may find it worth passing along that a criminal cyber mercenary group (similar to [DeathStalker](https://securelist.com/deathstalker-mercenary-triumvirate/98177/) in that they don't seem to be associated with gov cyber and are targeting people and businesses for money.) \n\n&amp;#x200B;\n\n/\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\* **EMAIL BELOW** \\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*/\n\nI have information to submit that is in relation to several cyber offensives in Southern California and may be affecting Canada and other locations as well.    \nFirst and foremost, this is privileged information and I can be reached in person, phone or email to discuss my findings further.  There is an active cyber attack against me and others and additional surveillance or signal overlap could be dangerous. Please do not interject until we have spoken.  \nTo begin, the use of the word Ultrasonic may be incorrect, as the use of ultrasonic signal injection is simply one aspect of the attack model that will be described.  \nI discovered a new cyber attack model during an investigation that began in Fullerton, CA. This email is lengthy and I've included video links and links to information and studies reinforcing my findings. Some of these findings may cross over into current investigations regarding the US and Canadian Embassies in Cuba.  \nA model of attack was discovered that combines several advanced cyber techniques which increase the power output within a building which impacts all devices connected to power,  devices, cables and air gapped machines and drives within a certain range while avoiding detection. I've included a recently recorded video below showing an active event. I was able to run a series of tests which I'll explain below.  \nSome of the attack techniques included in this new attack model have been documented, such as PowerHammer, SurfingAttack and DolphinAttack, but the model of attack has not, to my knowledge, been documented.  It's quite complex and I've been able to identify every aspect of the attack including physical evidence, professional reports, engineering reports, spectrum and signal analysis which confirm these findings. PsychoPy3 studies may fall within this model.  \nFirst, the use of additional power into an environment which increases monitor and device EM emissions, allows for air-gapped attacks throughout an affected area. In most, if not all, of the documented analysis such as, [BRIGHTNESS: Leaking Sensitive Data from Air-Gapped Workstations via Screen Brightness](https://arxiv.org/pdf/2002.01078.pdf), EM output allows for this excess in power to overlay and connect with other air-gapped devices.   \nThe attack model requires 3 components for the assailants to successfully deliver. These are power, sound and signal. With these 3 components present, they are able to deliver a harmful signal attack from mobile and networked devices. This attack is rolled out in a series of steps that include signal attacks or injections to enable remote execution and automation.  For example, In areas that are under surveillance or similar, their attack utilizes this existing signal to piggyback and compromise, thus confusing the victim and causing misdirection.     \nTo expand further on mobile devices, I would like to add the significance of this statement.  There are over 300 million new cell phones in use as we speak.  The attack vector, when this is mentioned is self evident, as well all have at least one and it stands to reason that this would be the most expensive delivery mechanism in human history.  \nThe attack model utilizes remote triggering software. Once a mobile or networked device is affected, it spreads out via bluetooth and ultrasonic and impacts devices within the surrounding area from 30-40ft ranges.   \nThe model of attack allows for the items listed below and is being used for extremely malicious and harmful impacts, not only to devices, but to humans.  This model allows the attackers to cause physical damage in the more extreme cases. The most apparent impact to humans is called the Frey Effect which causes an irritating clicking sound to the eardrum and inner ear canal and is a product of electricity or increased EM levels combined with a signal attack.  \nMeasurements were taken of the affected area and spectrum analysis ran for confirmation that mobile device emissions play a pivotal role in relaying information to and from the attack. The frequency bands were recorded from mobile and fall under private sector licensing.  These frequency bands were recorded along with active attack measurements. It appears to be a combination or overlapping signals which allow for the damaging impact to occur.  \nAdditionally, we ran EM and Voltage tests which showed surprising results. While standing in an affected area, there were measurable Voltage readings emitting from affected devices as well as measurable voltage ratings that were measured on the skin of people standing within the affected area. We repeated these tests outside of the building and there were no measurable amounts of voltage or EM.  We repeated these tests several times with the same results.   \nI have copies of impacted devices, such as mobile phones, usb drives, hard drives and other physical evidence used in these attacks. These could help provide evidence for your case. A device was recovered from the scene of the first attack that has been confirmed by the manufacturer and engineers.  This 3rd party device was proven to cause a similar EM output which allowed for the first of many attacks utilizing techniques such as PowerHammer, Data or Air Gapped Devices, etc.  \nIt was determined through evidence collection, testing and verification that the following items are part of the attack model:  \n\n\n1. Data Injection\n2. Audio Recording\n3. Voice Capture &amp; Delivery\n4. Location Reporting (Victim in a specific location in a home)\n5. Disruption of Communication Devices\n6. Increase EM on monitor output \n7. Increase EM on mobile device screen\n8. EM output affecting appliances\n9. Delivery mechanism - mobile device\n10. Remote Software Attack after initial injections\n11. Bluetooth to speaker and device\n12. Ultrasound Frequency emission \n13. Data exfiltration and device disruption via BT or US\n14. Overheating devices  \n15. Interrogation\n16. Physical impacts such as hearing impairment, hypertension and pain through increased DB levels\n17. Nonlinear sound frequency delivery\n\n* Malicious Frequencies ranging from 0Hz - 12000Hz / 172 Db level (max recorded)\n\nThe list above sounds extreme, but the most dangerous aspect of the attack model is that it has the ability to change perception by its model of use.  What I mean by this, is that the attack model utilizes cyber technology, non-linear sound frequency, electromagnetics, signal saturation, science, and signal attacks to effect a series of outcomes and effects against their victims.    \nWhile analyzing an affected area of this kind, it is recommended to remove power and signal completely, move the affected devices to a secure test location with proper measurement tools, and conduct forensics from there.  A team standing in an EM affected area is, not only, unsafe, but can cause equilibrium issues, short term memory loss, and so forth. If the power has been compromised, it may be necessary to test all power circuits within the building along with copper water pipes for current. \n\n  \nThe assailants are able to use non-linear and advanced cyber attack methods to penetrate a home or business, leaving very little trace as they are accessing the target through signal or RF, which enables them to attack from a distance, infect devices which impact the speakers on other electronics and spreads out like a virus.  The increased EM field created from an attack, also creates an extended and accessible signal area and saturation which can fill an entire workspace.  The delivery via radio frequency can be impacted and manipulated via radio antenna such as a television, mobile device or TV Antenna along with the cables that are connected to them.   \nDuring my investigation I discovered that the sound frequency attack is delivered and coupled with the attack described above.  I took a video of this being used and is included in the video links below.   \nThis kind of model allows the attackers to gain access to computers and networks through non-linear methods, as they are not accessing these devices through traditional means. This new signal attack allows for data to be injected or exfiltrated through nearby devices and connectivity through the increased EM Field created. \n\n  \n**Interesting Note:** Many of the sound frequency ranges recorded during an attack were within the same frequency range as what our brain communicates in.  This causes severe headaches, nose bleeds, hearing damage, equilibrium issues, joint damage, fatigue, extreme anxiety and reduced cognitive function.  The extensive exposure to this attack can cause temporary memory loss, hearing loss, and other neurological damage. \n\n  \nThis cyber attack model uses a mathematical algorithm, originally designed by mathematician John Nash at Stanford and was called Game Theory. It was adapted over time to include Economics, Strategy, Business and Warfare.  It was adapted to [Hyper Game Theory](https://www.hindawi.com/journals/gt/2015/570639/).  This model is used as a method to confuse and misdirect the victims. The cyber technology used has many attack tools used to affect several different kinds of outcomes, such as data exfiltration and manipulation, surveilling victims, victim location identification, and so on.  There are many more complexities to this model of attack that I've outlined in a full analysis, complete with 3rd party confirmations, engineering reports, data, and physical evidence.  \nI was able to successfully analyze this model and confirmed my findings through an analysis team with [SofWerx](https://www.youtube.com/watch?v=g3dS74TUHEI) who accurately analyzed an identical attack 1 year after my analysis was complete.  They were lacking first hand information which did not allow them to identify the model of use.  \n**Concern:**  This model of attack is being implemented in and around Orange and Los Angeles County.  I understand that the 5 dimensions of Cyber are complex, and sometimes things are missed.  A part of this model includes cyber attack variations of [PowerHammer](https://arxiv.org/pdf/1804.04014), [SurfingAttack's](https://surfingattack.github.io/papers/NDSS-surfingattack.pdf) &amp; [DolphinAttack's](https://acmccs.github.io/papers/p103-zhangAemb.pdf). Those, in and of themselves have been identified and documented, but the model of use and how it works with this complex attack model, have not.  To my knowledge, the information that I would like to discuss with you has not been documented publicly and would be considered highly valuable information.\n\n  \nWhat I learned from this is that, based on the tools used by the attackers, it causes a great deal of confusion for a victim because of the impact to the central nervous system, neurology, joints, equilibrium through Ear, Nose &amp; Throat (ENT).  This vibration, or oscillation rather, is caused by a signal attack.  It's not generally accompanied with a sound ([Cicadas](https://www.propublica.org/article/diplomats-in-cuba)) because it's several things hitting you all at once and depending on which and in what order, your experience will vary slightly.  I was able to make a 100% determination on the attack, how it is implemented and the model of use.  It is delivered by mobile device. This impacts all other devices in the area much like a virus does.  Additional power is delivered through coax via RF, increasing power output throughout an area. Because the attack combines 3 prominent factors which are Power, sound and signal, it can be very confusing as to where it is coming from and what is causing it.   \nDiscrete Fourier Transform (DFT) is part of the attack described above and creates the measurable oscillation which coupled with the signal attack, can be very damaging.  I've included links below regarding this information.\n\n&amp;#x200B;\n\n  \nSignal and data can only travel into a closed proximity such as a business through a power cable or power smart meter, coax cable to a router, or mobile device if there is no Wifi available. All modern electronic devices use Bluetooth and Ultrasonic Signal Communications (Near Field Communications).  \n\n  \nThe increased EM output that was recorded allows for a signal or sound attack the needed amplitude necessary to make the attack signal harmful and dangerous. (Video Link Below)  \nUnder normal circumstances, those communications would be considered passive, in that they are transferring non-malicious data back and forth to proximity based devices. The same thing is happening in the case of smart meters.  The problem is when an external signal is injected, which can be done by remote attack attack software.   \nI was able to determine that the mobile device, when turned on after being off and in a protective case, caused an immediate oscillation to the legs, neck and arms.  This occurred while high levels of EM output was occuring in affected areas. I ran through these tests dozens of times and was able to make a final determination. The most commonly open and unprotected signal in a mobile device is BlueTooth and the beacon it emits.  Once compromised, it can, not only affect the speakers, but cause the ultrasonic emission which crossed with other signal frequency makes it a harmful attack frequency.\n\nWhat has made this attack model so hard to fully identify is that it makes it overwhelming for the victim to locate and identify because we're not used to anything close to this. In addition, most victims are not that tech savvy and would lack the ability to articulate the combination of things that are happening. \n\nOnce an attacker hits your device, it's like a fast moving virus and once the speaker is affected, there are now 2 methods of signal communication happening within an affected area.  \nTo date, it is my understanding that this attack has affected many Americans and is currently spreading fast.  One of the most paramount concerns is that this technology has the ability to impact Economics and Politics alike.      \nIn 2005, the Stuxnet worm that destroyed physical equipment was the first time that something of this magnitude was recorded.  This current attack model described above may be the first time in recorded history that a computer attack model could access any network and cause a human physical harm.  \nI would like to discuss these findings with your team in further detail. Because of the sensitivity of this situation and information obtained, meeting by phone or in person is preferred. I look forward to speaking with you.\n\n  \nIn closing, I was able to map continuity aspects of the intrusion and strongly believe that there are aspects of low level AI implemented within the attack for automation and data collection. I can explain more as we have a chance to talk and I am able to turn over all my findings, analysis and evidence.  Thank you again and I look forward to speaking with your team.\n\n  \n**UltraSonic Emission from Television - Measured and Recorded**  \n[https://www.youtube.com/watch?v=7WGWQtNLMAQ&amp;feature=youtu.be](https://www.youtube.com/watch?v=7WGWQtNLMAQ&amp;feature=youtu.be)  \n\n\n**Ultrasonic - Non-linear Sound Frequency Attack**  \n[https://www.youtube.com/watch?v=PHR8or5Ejjc&amp;feature=youtu.be](https://www.youtube.com/watch?v=PHR8or5Ejjc&amp;feature=youtu.be)  \n\n\n**Frey Effect- Recorded with Otoscope - Linear recording Clip 02**  \n[https://www.youtube.com/watch?v=UATHXpaaNQk&amp;feature=youtu.be](https://www.youtube.com/watch?v=UATHXpaaNQk&amp;feature=youtu.be)  \n**Electromagnetic Cyber Attack similar to PowerHammer - Impacts airgapped devices**[https://www.youtube.com/watch?v=3uceI1wZljs](https://www.youtube.com/watch?v=3uceI1wZljs)  \n**DISCRETE FOURIER TRANSFORM:**  *Many digital signal processing systems employ the OFT for a variety of applications. The design and implementation of digital filters, spectral analysis of signals, and detection of targets from radar echoes are a few examples.*  \n\n\n* [https://web.eecs.umich.edu/\\~aey/eecs206/lectures/dft2.pdf](https://web.eecs.umich.edu/~aey/eecs206/lectures/dft2.pdf)\n* [https://ocw.mit.edu/courses/mechanical-engineering/2-161-signal-processing-continuous-and-discrete-fall-2008/study-materials/fourier.pdf](https://ocw.mit.edu/courses/mechanical-engineering/2-161-signal-processing-continuous-and-discrete-fall-2008/study-materials/fourier.pdf)  \n\n* [https://erickson.academic.wlu.edu/files/courses2020/sigproc\\_s2020/readings/DFT\\_Intro.pdf](https://erickson.academic.wlu.edu/files/courses2020/sigproc_s2020/readings/DFT_Intro.pdf)\n* [http://www1.udel.edu/chem/sneal/sln\\_tchng/CHEM620/CHEM620/Chi\\_8.\\_DFT\\_&amp;\\_Noise.html](http://www1.udel.edu/chem/sneal/sln_tchng/CHEM620/CHEM620/Chi_8._DFT_&amp;_Noise.html)\n* [https://apps.dtic.mil/dtic/tr/fulltext/u2/a058049.pdf](https://apps.dtic.mil/dtic/tr/fulltext/u2/a058049.pdf)\n\nDue to the mirroring of the DFT around fs/2, a signal component actually oscillating at a frequency of fs/2 + ∆f appears in the DFT at the aliased frequency fs/2 − ∆f. For example, say we are sampling an ECG signal at fs = 100 Hz. Say there is some strong signal at 60 Hz (the frequency of the US power grid!). This is ∆f = 10 Hz above fs/2 = 50 Hz. So the DFT will show a strong peak at 40 Hz. Of course, the real artist was the 60 Hz, but now shows up under a new name, an alias, of 40 Hz. These are indistinguishable from one another—which is generally bad news because it confounds signal analysis.  \n\n\n* [https://erickson.academic.wlu.edu/files/courses2020/sigproc\\_s2020/readings/DFT\\_Intro.pdf](https://erickson.academic.wlu.edu/files/courses2020/sigproc_s2020/readings/DFT_Intro.pdf)\n* [https://www.mathworks.com/help/matlab/ref/fft.html](https://www.mathworks.com/help/matlab/ref/fft.html)  \n\n\n📷  \n\n\n* [http://www1.udel.edu/chem/sneal/sln\\_tchng/CHEM620/CHEM620/Chi\\_8.\\_DFT\\_&amp;\\_Noise.html](http://www1.udel.edu/chem/sneal/sln_tchng/CHEM620/CHEM620/Chi_8._DFT_&amp;_Noise.html)\n* [https://www.princeton.edu/\\~cuff/ele201/kulkarni\\_text/frequency.pdf](https://www.princeton.edu/~cuff/ele201/kulkarni_text/frequency.pdf)\n\nWarm regards,",
        "title": "NEW Cyber Attack Model: Ultrasonic - EM - Air-Gapped Devices - Discrete Fourier Transform",
        "score": 1,
        "id": "kjrlxv",
        "commsNum": 1,
        "timeStamp": "2020/12/24-18:36:59",
        "author_name": "goodinfosource",
        "is_self": true,
        "locked": false,
        "num_comments": 1,
        "over_18": false,
        "spoiler": false,
        "subreddit": "malware",
        "stickied": false,
        "url": "https://www.reddit.com/r/Malware/comments/kjrlxv/new_cyber_attack_model_ultrasonic_em_airgapped/"
    },
    "posts": {
        "gh9ty9w": {
            "comment": "[removed]",
            "timeStamp": "2020/12/28-00:29:58",
            "id": "gh9ty9w",
            "is_submitter": false,
            "link_id": "t3_kjrlxv",
            "parent_id": "t3_kjrlxv",
            "score": 1,
            "stickied": false,
            "author_name": "[deleted]"
        }
    }
}