{
    "op": {
        "upvote_ratio": 1.0,
        "selftext": "Hello, \n\nmy computer has infected by a ransomware named by \"Naqi\" \n\ni search on internet at all but i can't find anything about it, my files are importand and i don't have money for save them.\n\nI really need help, if you guys know anything about it i apperaciate you at all. \n\nMessage by attackers;\n\nATTENTION!\n\n&amp;#x200B;\n\nDon't worry, you can return all your files!\n\nAll your files like pictures, databases, documents and other important are encrypted with strongest encryption and unique key.\n\nThe only method of recovering files is to purchase decrypt tool and unique key for you.\n\nThis software will decrypt all your encrypted files.\n\nWhat guarantees you have?\n\nYou can send one of your encrypted file from your PC and we decrypt it for free.\n\nBut we can decrypt only 1 file for free. File must not contain valuable information.\n\nYou can get and look video overview decrypt tool:\n\n&amp;#x200B;\n\nPrice of private key and decrypt software is $980.\n\nDiscount 50% available if you contact us first 72 hours, that's price for you is $490.\n\nPlease note that you'll never restore your data without payment.\n\nCheck your e-mail \"Spam\" or \"Junk\" folder if you don't get answer more than 6 hours.\n\nTo get this software you need write on our e-mail:\n\n[manager@mailtemp.ch](mailto:manager@mailtemp.ch)\n\n&amp;#x200B;\n\nReserve e-mail address to contact us:\n\n[helprestoremanager@airmail.cc](mailto:helprestoremanager@airmail.cc)",
        "title": "Infected ransom",
        "score": 1,
        "id": "st59a5",
        "commsNum": 1,
        "timeStamp": "2022/02/15-07:18:47",
        "author_name": "baitrus",
        "is_self": true,
        "locked": false,
        "num_comments": 1,
        "over_18": false,
        "spoiler": false,
        "subreddit": "malware",
        "stickied": false,
        "url": "https://www.reddit.com/r/Malware/comments/st59a5/infected_ransom/"
    },
    "posts": {
        "hx1vet2": {
            "comment": "From sidebar:\n\n* This is a subreddit for readers to discuss malware internals and infection techniques. Posts requesting technical support will be removed and bans will be handed out liberally.\n\nSearching on that email shows Djvu ransomware. Recovery is unlikely.",
            "timeStamp": "2022/02/15-08:27:11",
            "id": "hx1vet2",
            "is_submitter": false,
            "link_id": "t3_st59a5",
            "parent_id": "t3_st59a5",
            "score": 3,
            "stickied": false,
            "author_name": "LightningRurik"
        }
    }
}